var idCount = 0;

var RespNames = ["第幾張卡","第幾個反應","Location","DQ","位置編號","決定因子","FQ","(2)","內容","P","Z-Score","Special Score"];

var CardDict = ["Card I","Card II","Card III","Card IV","Card V","Card VI","Card VII","Card VIII","Card IX","Card X"];
var LocDict = ["W","D","Dd","S","WS","DS","DdS"];
var DQDict = ["+","o","v/+","v"];
var FQDict = ["+","o","u","-"," "];
var ZDict = ["ZW", "ZA", "ZD", "ZS"];
var ZestDict = [null,null,2.5,6,10,13.5,17,20.5,24,27.5,31,34.5,38,41.5,45.5,49,52.5,56,59.5,63,66.5,70,73.5,77,81,84.5,88,91.5,95,98.5,102.5,105.5,109.5,112.5,116.5,120,123.5,127,130.5,134,137.5,141,144.5,148,152,155.5,159,162.5,166,169.5,173];

var AllDetDict = ["Ma","Mp","Map","FMa","FMp","FMap","ma","mp","map",//8
"FC","CF","C","Cn","FC'","C'F","C'",//15
"FT","TF","T","FV","VF","V","FY","YF","Y","Fr","rF","FD","F"];

var AllConDict = ["H","(H)","Hd","(Hd)","Hx","A","(A)","Ad","(Ad)",//8
"An","Art","Ay","Bl","Cg","Ex","Fi","Fd","Ge","Hh","Cl","Sc","Sx","Xy","Id",//23
"Bt","Ls","Na"];

var AllSSDict = ["DV1","DV2","INC1","INC2","DR1","DR2","FAB1","FAB2","ALOG","CON",//9
"AB","AG","COP","CP","GHR","PHR","MOR","PER","PSV"," "];

var ZScore_Tran =
[[1,4,6,3.5],[4.5,3,5.5,4.5],[5.5,3,4,4.5],[2,4,3.5,5],[1,2.5,5,4],
[2.5,2.5,6,6.5],[2.5,1,3,4],[4.5,3,3,4],[5.5,2.5,4.5,5],[5.5,4,4.5,6]];

var AllIndex = [0];

var AllConStr_Int =
[["Step1","Step2","Step3","Step4","Step5"],
[[["Finding1","AdjD = 0<br>& CDI < 4","一般來說，個體的控制能力和壓力忍受力與大部分人相似。"],
["Finding2","AdjD = 0<br>& CDI = 4 or 5","個體的人格組織較預期更為不成熟一些。這往往會在因應日常生活需求方面造成脆弱性。這些困難通常會在人際情境下展現，且一旦發生便容易導致控制問題。"],
["Finding3","AdjD > 0","個體相較大多數人有更堅毅的壓力忍受力，且經驗到控制問題的可能性低。這並不表示適應得較好，它僅顯示意志之行為控制能力較好。"],
["Finding4","AdjD = -1","個體呈現長期刺激超載的狀態。因此他的控制能力和有效應對壓力的能力低於預期。有些決定和行為不會經過深思或妥善實施，且有衝動傾向。雖然在壓力下更容易出現控制問題或更容易出現混亂，但在結構化及明確情況下這些事件不太可能發生。<br>具嚴重心理困擾者，通常可在其熟悉且需求及期待是常規且可預測時能適切運作。當需求及期待超出個人習慣的程度時，失控的風險會大增。"],
["Finding5","AdjD < -1","在壓力下，個體極易失控及變得混亂。通常經驗過多次的錯誤判斷, 情緒困擾, 行為無效等事件。長期受到想法及情感超載影響，且通常只有在高度結構, 常規, 令其有些控制感的環境下，才得以適切運作。"]],
[["Finding1","EA 介於平均<br>& AdjD = 0","AdjD 是具可信且有效的控制能力和壓力忍受力的指標。"],
["Finding2","EA 介於平均<br>& AdjD > 0","AdjD 可能有誤，需於 Step4 (關注 es & Adj es) 更進一步評估。"],
["Finding3","EA 介於平均<br>or above & AdjD < 0","Adj es 意外的高，需於 Step4 (關注 es & Adj es) 更進一步評估。"],
["Finding4","EA 超過平均<br>& AdjD > 0","AdjD 是具可信且有效的控制能力和壓力忍受力的指標。"],
["Finding5","EA 超過平均<br>& AdjD = 0","Adj es 意外的高，需於 Step4 (關注 es & Adj es) 更進一步評估。"],
["Finding6","EA < 6.5<br>& AdjD < 0","可得資源更顯有限"],
["Finding6","EA < 6.5<br>& AdjD ≥ 0","個體於複雜的社會情境中，長期容易因日常生活壓力變的混亂。他們在結構化及無模糊狀況的環境中能有效運作。"]],
[["Finding1","EB 兩邊皆 > 0<br>& EA > 3.5<br>& L < 1","EA 及 AdjD 是可信且有效的"],
["Finding1","EB 兩邊皆 > 0<br>& EA > 6<br>& L > 0.99","EA 及 AdjD 是可信且有效的"],
["Finding2","EB 兩邊皆 > 0<br>& EA < 4<br>& L < 0.99","EA 是可信的。但 AdjD 可能有誤，應於 Step4 & Step5 仔細審視 es & Adj es"],
["Finding3","EB 兩邊皆 > 0<br>& 3.5 < EA < 6.5<br>& L ≥ 1","EA 是可信的。但 AdjD 可能有誤，若 AdjD > 0，對控制能力的假設應於 Step5 仔細審視 es 後再行調整。"],
["Finding4","EA < 4<br>& L ≥ 1<br>(尤其當 R < 17)","EA, D, AdjD 皆不適用，宜放棄解釋「控制與壓力忍受力」此向度。"],
["Finding5","M = 0<br>& SumC > 3.5","個體被情感淹沒，情緒的洪流通常不是慢性或如特質般的歷程，而是當個體無法有效應對強烈情緒時發展出的情況，這些感受的強度是會引起混亂且造成情緒淹沒的不穩定狀態。這通常會導致一些原不會發生的行為，此行為是一種釋放形式，行為後通常伴隨某種心理重建。<br>情緒洪流對思考造成重大影響，尤其對於延宕思考活動的能力，這是進行決策時賴以維持適切注意力及專注度的要件，因此在此情況下，思考或行為衝動性的可能明顯增加<br>此時 AdjD, EA 皆不可信且無效，宜停止「控制與壓力忍受力」此向度的解釋，最多解釋為個體此時控制能力是脆弱的。<br>若 L < 1 & EA > 5，此時 D 分數尚能作為控制能力的粗略指標，但仍易有誤。<br>不過此時不需詳述情緒洪流，於「情感」向度會深入討論。"],
["Finding6","M > 3<br>& SumC = 0","個體正投入相當的精力以大幅遏止或封閉情感，這通常需要比起常人擁有的資源更大量的資源，因此很可能刺激過載及導致混亂。<br>此時 AdjD, EA 皆不可信且無效，宜停止「控制與壓力忍受力」此向度的解釋，最多解釋為個體此時控制能力是脆弱的。<br>若 L < 1 & EA > 5，此時 D 分數尚能作為控制能力的粗略指標，但仍易有誤。<br>不過此時不需詳述情緒壓抑，於「情感」向度會深入討論。"]],
[["Finding1","Adj es 介於平均","EA 及 AdjD 是可信且有效的"],
["Finding2","Adj es 超過平均","EA 是可信的，但 Adj D 可能保守估計或甚至低估個體的控制能力及壓力忍受力，高 Adj es 顯示有一些不尋常的心理複雜度，此可能性應於 Step5 仔細審視。"],
["Finding3","Adj es 低於平均","Adj D 可能高估個體的控制能力及壓力忍受力 (尤其當 AdjD > 0 時)，此可能性應於 Step5 仔細審視。"]],
[["Finding1","L-eb < R-eb<br>& es ≥ 4","個體正經驗一些痛苦 (雖對 AdjD 沒有影響，但敏銳的羅夏克者在結論此向度時會留意此解釋)。"],
["Finding2","FM > 5","個體正經驗較平常更看似隨機或脫節的思維模式，此些思考活動通常是由異常多的未滿足需求所引發，這些需求相關的東西會干擾更深思熟慮的思考模式，並且經常干擾注意力及專注度。"],
["Finding3","FM < 2","個體未以尋常方式經驗到需求，或較大部分人更快速的採取行動。"],
["Finding4","SumC' > 2","個體過度內化那些他想外化的感受，此心理歷程可能招致幾種不適的主觀經驗，包含: 焦慮, 難過, 緊張, 憂心, 以及可能導致身體不適。"],
["Finding5","SumV > 0","個體較大多數人更投入關注於自身負向特徵的自我審視，此類內省經常導致不舒服的經驗及自我批評，且經常為憂鬱及自我毀滅思維的前驅。<br>大多數情況，此為持續性的自我貶低。但 1 或多個 V 反應也可能由某一情境下罪惡或羞愧的經驗所引發。若有 V 反應，應仔細審視近期史以決定自我貶抑是否可能是特定情境引發。若近期史支持此可能性，應扣除 V 反應以確認是否改變 Adj es 進而改變 AdjD。若 AdjD 改變，則宜順應調整此向度的解釋。"],
["Finding6","SumT > 1","個體正經驗情感剝奪。大部分情況下，此經驗是與某一情境相關，且應可藉由仔細審視其近期史而輕易辨識出 (如近期痛失情感上重要的客體)。若其近期史支持此觀點，則 AdjD 可能有誤，此時計算 Adj es 應僅包含 1 次 T，並確認 AdjD 是否因此改變。"]]]];

var AllSitStr_Int =
[["Step1","Step2","Step3","Step4","Step5","Step6","Step7"],
[[["Finding1","D < AdjD<br>& es - Adj es ≥ 2","D 分數間的差異應非偽陽性"],
["Finding2","D < AdjD<br>& es - Adj es < 2","此時 D 分數間差異來自 es & Adj es 的些微差異，應再次審視 m 及 Y 的編碼有誤。"],
["Finding2a","m, Y 編碼無誤","應審視可能造成情境壓力的近期史<br>1. 若近期史詳細且其中具可被個體經驗為壓力的情境，則由 D 分數間差異衍生的假設被支持。且當 D < 0，個體亦具衝動的可能性。應持續往下解釋此向度。<br>2. 若近期史非常簡短或不精確，沒有提供關於近期壓力經驗的有用資訊，則 D 分數間差異衍生的假設及關於衝動的假設皆需暫為懸置，若此些假設要納入結論，則應以相當保守的措辭呈現。應持續往下解釋此向度。<br>3. 具詳細近期史，但不包含關於情境壓力經驗的資訊，此時應對關於情境壓力及衝動的解釋保持極為保守。可以停止此向度的解釋，若要納入此向度解釋，應採最為保守的措辭。"]],
[["Finding1","AdjD - D = 1","情境壓力的影響屬輕度至中度，呈現有一些心理困擾，但不致於混亂。"],
["Finding2","AdjD - D > 1","呈現有大量的壓力經驗，壓力的影響常造成對常規的思考及行為模式有很大的干擾"]],
[["Finding1","m ≤ 3*SumY<br>& SumY ≤ 3*m","壓力導致的心理結果廣泛影響到思考及情緒。<br>當其一 (m, SumY) 超過另一2倍以上，雖未達3倍，仍提供一些關於壓力對思考或對情緒影響的線索。"],
["Finding2","m > 3*SumY","壓力對思考有巨大的影響，注意力及專注度很可能因此有明顯受損。"],
["Finding3","SumY > 3*m","壓力對情緒有較大的影響，可能經驗到難以言說的焦慮, 緊張, 痛苦。"]],
[["Finding1","(Sum T ≤ 1 & SumV = 0)<br>or (SumV > 0 & Ego Index ≤ 0.32)","不需再一次考慮 D 分數間的差異。"],
["Finding2","Sum T > 1<br>or (SumV > 0 & Ego Index > 0.32)","D 分數可能有誤，應審視近期史，如:<br>(SumT > 1) 經驗到的情境壓力可能與近期情緒失落有關，若近期史無明顯近期情緒失落，則無須再一次考慮 D 分數間因 T 造成的差異<br>(SumV > 0 & Ego Index > 0.32) 一些情境壓力可能與近期的罪惡感及懊悔有關，若近期史無明顯近，則無須再一次考慮 D 分數間因 T 造成的差異<br>若近期史有情緒失落 (T) 或有罪惡懊悔 (V)，則重新計算 Adj es，若有情緒失落近期史則 SumT 僅保留1個，若有罪惡懊悔近期史則 SumV 為 0，接著重新計算 AdjD。<br>若因此造成 D 分數間差異增加，則應再次考慮 Step2 的解釋"]],
[["Finding1","D ≥ 0","雖有情境壓力存在，且壓力忍受力及控制能力較尋常時低下，然情境壓力影響尚屬適度，未有因失控而呈現衝動的現象。<br>此時 Pure C 不表示衝動，M- 及 Mnone 不表示情境引發的思考失控。"],
["Finding2","D < 0","個體呈現過載的狀態，可能經驗到比他能輕鬆因應的需求還要多的需求，導致控制能力受損，決策或行為可能未經深思或適切施行，可能有衝動。<br>此時 Pure C 表示有情緒展現的衝動性，M- 及 Mnone 表示可能因過載狀態而有思考控制受損的可能。"],
["Finding2a","D = -1","個體於其熟悉的環境，尤其情境具結構化及明確時，能適切運作。然當情境越加複雜或模糊時，個體越加容易混亂且有衝動的思考或行為 (尤其當 EA 低於平均時)。<br>若有 Pure C，顯示個體可能具有情緒衝動性，且通常呈現於失控的行為。<br>若有 M- 或 Mnone，顯示情境壓力可能使判斷混沌或造成怪異思考，這須於「思考」向度更仔細審視。"],
["Finding2b","D < -1","個體極易受控制困難影響，有很大可能呈現混亂，如有思考或行為的衝動性，僅在非常結構化及日常的情境下能適切運作。隨 D 越小，此類困境越加劇。"]],
[["Finding1","Blends (m) or (Y) > 0<br>& Blends (m) or (Y) < 20% Blends","情境壓力僅造成輕微的心理複雜度提升。"],
["Finding2","Blends (m) or (Y) 介於 20% - 30% Blends","情境壓力造成中度的心理複雜度提升，當 D < 0 時此現象尤為重要，因當過載時心理複雜度增加會加劇衝動行為的可能。"],
["Finding3","Blends (m) or (Y) > 30% Blends","情境壓力造成巨量的心理複雜度攀升，可能造成個體容易混亂，當 D < 0 時此現象尤為重要，因其會加劇混亂及衝動的可能性。"]],
[["Finding1","Blends (C.T or .V or .C') = 0<br>& Blends (C.Y) = 1","情境壓力可能造成一些情緒混淆。"],
["Finding2","Blends (C.T or .V or .C') > 0<br>& Blends (C.Y) = 1","個體有既存的情緒混淆，且因情境壓力而加劇此混淆。"],
["Finding3","Blends (C.T or .V or .C') = 0<br>& Blends (C.Y) > 1","情境壓力可能造成大量的情緒混淆，當 D < 0 時，情緒混淆亦加劇混亂及衝動的可能性。"],
["Finding4","Blends (C.T or .V or .C') > 0<br>& Blends (C.Y) > 1","情境壓力大大加劇既存的情緒混淆，亦因此容易有心理混亂，當 D < 0 時，此混淆更容易增加衝動的可能。"]]]];

var AllAff_Int =
[["Step1","Step2","Step3","Step4","Step5","Step6","Step7","Step8","Step9","Step10","Step11","Step12","Step13","Step14","Step15","Step16"],
[[["Finding1","DEPI = 6 or 7<br>& CDI < 4","存在嚴重且可能失能的情緒問題，常抱怨痛苦, 憂鬱, 行為失功能。"],
["Finding2","DEPI = 5<br>& CDI < 4","個體的人格組織含括頻繁的情感困擾經驗，經常抱怨反覆出現的憂鬱, 喜怒無常, 緊繃, 焦慮。然而許多人沒有報告出涉及負向情緒經驗的週期事件，但即使沒有說出負向情緒經驗，也不應摒棄 DEPI 的異常現象，他可能反映出潛在的情緒困擾。"],
["Finding3","DEPI = 6 or 7<br>& CDI = 4 or 5","個體可能有情緒混亂的狀態，但情緒問題可能源自於建立及維持有效有益人際關係的困難。容易於社交情境中陷入困境，因其與他人的關係通常是標籤, 脆弱, 不滿足的。因此，失望, 痛苦, 甚至絕望的出現都是常見的，並且在此期間出現的情緒混亂，常與慢性憂鬱症的表現非常相近。<br>不過在心理上他們與常見的情感障礙有所差異，因為他們的情緒經常隨著他們的支持系統增強或減弱而改變。因此治療計畫及目標的制度上需有所區別，應以社會適應為主要介入目標，並謹慎使用抗憂鬱劑藥物。"],
["Finding4","DEPI = 5<br>& CDI = 4 or 5","個體可能因社會適應困難而容易有情感問題。"]],
[["Finding1","EA < 4","資訊不足，難有效區辨其因應風格"],
["Finding2","L-EB = 0<br>& R-EB > 3.5","個體正被情緒淹沒。應避免依 EB 推論其具穩定的因應風格，而是關注其目前情緒狀態。強烈的情緒明顯干擾其思考，尤其使其於決策歷程中的注意力及專注力受損，易有思考或行為的衝動。<br>一般來說，此情緒狀態是暫時的，且持續於個體無法有效應對異常強烈情緒的期間。當有情緒氾濫時，應謹慎的於其脈絡下分析情感相關的資料，這些資訊對於理解其目前的情感狀態很有用。"],
["Finding3","R-EB = 0<br>& L-EB > 3","個體極為限制或壓抑情緒。應避免依 EB 推論其具穩定的因應風格，而是關注其目前情緒狀態。個體投注大量心力以確保情緒被隱藏或控制，通常無法長時間維持此狀態，且情緒抑制期間易使人感到非常不舒服。<br>若抑制時間拉長，個體會出現某些形式的情緒釋放或移轉。若沒有釋放或移轉情緒，個體很可能被持續增強的情感壓垮，並且陷入不穩定的狀態，亦即情緒將主導大部分心理功能，迫使個體在無視環境現實下做出能緩解情緒的舉動<br>當有情緒抑制時，應謹慎的於其脈絡下分析情感相關的資料，這些資訊對於理解其目前的情感狀態很有用。"],
["Finding4","extratensive style<br>& Lambda < 1","個體於問題解決及決策判斷時，傾向將感受結合進思考之中，且易依循感受並受其影響，亦常以試誤行為驗證假設。由於試誤行為為其常規操作，當面臨問題解決錯誤時，個體較具忍受度也較不在意；但另一方面，長期挫折對情緒的影響卻顯得更為強烈。另外，此類人更傾向開放地表達感受，也較不關注於去控制或調節這些情緒展現。"],
["Finding5","extratensive style<br>& Lambda > 0.99","一般來說，個體傾向依循情感並受其影響，亦偏好以試誤行為驗證假設。然而其具有迴避風格，這會使其難以釐清複雜的情緒經驗，在這種情況下，當個體結合感受到思考中以進行決策判斷時，感受可能造成過多或過少的影響，而造成行為成效不佳，像是過於忽視對情緒展現的控制，可能有時會衝動。"],
["Finding6","introversive style<br>& Lambda < 1","個體於問題解決及決策判斷時，傾向減少納入感受、避免採用試誤行為、更仰賴內在的評估而非外在回饋以形成判斷。較不能忍受問題解決時發生的錯誤，因此在決策判斷時顯得更為謹慎。當其願意開放地表達感受時，會去關注對這些情緒展現的調節及控制。"],
["Finding7","introversive style<br>& Lambda > 0.99","個體於問題解決及決策判斷時，傾向減少納入感受、避免採用試誤行為、更仰賴內在的評估以形成判斷。但其亦具有迴避風格，這會影響其思考的效果，例如，內在思考需要耐心推敲，這與迴避風格中簡化事物的傾向有所衝突。當此類衝突出現時，個體會傾向簡化事物而較不仔細思考，亦易因此增加判斷失誤的可能。面對情緒展現的控制時，易因調控過於複雜費力，而傾向過度控制情緒或全然避免情緒展現。"],
["Finding8","ambitent<br>& Lambda < 1","面對問題解決及決策判斷時，個體沒有一致的因應風格，亦即情緒對於思考、問題解決、決策判斷的影響不一致。不一致容易導致混淆的狀態，有時候感受會過度干擾思考，另一些時候感受完全被摒除於思考之外。亦可能造成怪異的情緒表達，有時過度控制情緒表達，另一些時候則沒有節制的強烈表達情感。"],
["Finding9","ambitent<br>& Lambda > 0.99","個體具有簡化複雜刺激的迴避傾向，由於無一致的因應風格，其迴避傾向是更為廣泛的，通常當個體覺察情境是複雜或模糊時，就容易出現迴避傾向<br>面對問題解決及決策判斷時，個體沒有一致的因應風格，亦即情緒對於思考、問題解決、決策判斷的影響不一致。不一致容易導致混淆的狀態，有時候感受會過度干擾思考，另一些時候感受完全被摒除於思考之外。亦可能造成怪異的情緒表達，有時過度控制情緒表達，另一些時候則沒有節制的強烈表達情感。<br>迴避且不一致的因應風格，更容易有適應問題產生，尤其當環境複雜或模糊時。"]],
[["Finding1","extratensive style<br>& EBPer < 2.5","因應時，個體大部分時候傾向納入感受於思考之中，但當需要時，也能彈性的減少納入感受。"],
["Finding2","extratensive style<br>& EBPer ≥ 2.5","因應風格使用的彈性低，當情境需要審慎思考且減少感受納入時，其因應可能出問題。並且個體通常更少去調節情緒的展現。"],
["Finding3","introversive style<br>& EBPer < 2.5","因應時，個體傾向減少納入感受並審慎思考，但當需要時，也能彈性的納入感受以利決策。"],
["Finding4","introversive style<br>& EBPer ≥ 2.5","因應風格使用的彈性低，即使當直覺或試誤方式更佳有效率，仍傾向摒除感受而審慎思考以決策。並且幾乎所有的情緒展現都會被密切調節。"]],
[["Finding1","L-eb > R-eb<br>& SumT, SumC',SumV, SumY 無異常","無異常發現"],
["Finding2","L-eb > R-eb<br>& SumT, SumC', SumV, SumY 其一異常","若 SumT > 1: 若無近期情緒失落，則可能呈現有慢性孤獨感或情緒需求。<br>若 SumC' > 0: 可能呈現有因抑制情緒釋放及壓抑情緒影響的傾向，而有的易怒或負向情緒。C' 指標是有關於應被釋放的情緒感受卻被內化的心理歷程。<br>若 SumV > 0: 若無近期罪惡感或懊悔，則可能呈現有因持續的自我苛責或貶低的傾向而肇生的憂慮或負向情緒。<br>若 SumY > 2: 可能呈現有與無助感有關的負向感受。"],
["Finding3","(R-eb > L-eb & L-eb ≥ 3)<br>or (R-eb ≥ 4 & L-eb < 3)","個體正經歷一些痛苦，可能有憂鬱或焦慮，或可能是緊張、憂慮，或呈現生理不適，如：失眠、嗜睡、或其他形式。<br>若 SumT > 1: 若無近期情緒失落，則可能呈現有慢性孤獨感或情緒需求。<br>若 SumC' > 0: 可能呈現有因抑制情緒釋放及壓抑情緒影響的傾向，而有的易怒或負向情緒。C' 指標是有關於應被釋放的情緒感受卻被內化的心理歷程。<br>若 SumV > 0: 若無近期罪惡感或懊悔，則可能呈現有因持續的自我苛責或貶低的傾向而肇生的憂慮或負向情緒。<br>若 SumY > 2: 可能呈現有與無助感有關的負向感受。"]],
[["Finding","SumC' > WSumC","個體比起大多數人更為頻繁地壓抑情緒的釋放，也因此比起他人承受更多的不適感受。"]],
[["Finding1","Afr 介於平均","個體在處理及接觸情緒刺激方面，與其因應風格相同之同儕相似。"],
["Finding2","Afr 高於平均","個體易受情緒刺激吸引，且對情緒及情感交流很感興趣，常見於外向型因應風格。這不是一種危險因素，除非個體有控制或調節情緒的困難。"],
["Finding3","Afr 低於平均<br>& Afr > 0.43","個體較不願意處理或不感興趣於情緒刺激，常見於迴避型因應風格，他們傾向減少刺激複雜度。這不是一種危險因素，除非個體有控制或調節情緒的困難。"],
["Finding4","Afr < 0.44","個體具極力迴避情緒刺激的傾向，當面對情緒時經常感到非常不舒服，因此他們往往變得更加社交侷限或甚至社交孤立。通常會有其他證據也顯示其情緒侷限 (Step5)，或有明顯的情緒防衛 (Step7 & Step8)。此項發現對兒童及青少年尤為重要，因當其面對能使其發展的日常變化時，可能傾向迴避或極為謹慎的接近，而影響其發展。"]],
[["Finding1","Intell Index 介於 4 - 6","個體較大多數人更傾向以理智層次處理感受，這雖然減少或中性化情緒的影響，但此種否認形式亦傾向扭曲情境的真實意涵及其影響。"],
["Finding2","Intell Index > 6","當個體知覺到情感壓力時，將理智化作為主要的防衛策略。然隨著情緒刺激加劇，此策略會越顯無效，使其更容易呈現混亂。"]],
[["Finding","CP > 0","個體經常藉由正向情緒或情境的情緒價值，不適切地取代易怒、不愉悅的情緒、情緒刺激，藉此否認此些情緒的存在。這是一種無視或違反現實的近似歇斯底里的歷程。使用此否認形式者，通常會對其因應負向情緒的能力感到非常不適，且經常有情緒調節困難。因此，當知覺到環境中的困境時，其傾向扭曲現實以迴避之。此類防衛通常是很明顯的，經常使用者會發現他們常被他人評價為情緒表淺的。"]],
[["Finding1","CF + C + 1 ≤ FC ≤ 2(CF + C)<br>& C = 0","個體對情緒表達的調節或控制與大部分成人相近。但此對於15歲以下者是不尋常的發現，顯示其過度抑制情緒表達。"],
["Finding2","2(CF + C) < FC < 3(CF + C)<br>& C = 0","相較於大部分人，個體更傾向嚴密控制情緒的表達。這對15歲以下者是極端不尋常的發現，顯示其極度抑制情緒表達。"],
["Finding3","FC ≥ 3(CF + C)<br>& C = 0","相較於大部分人，個體過度控制情緒的表達。這通常表明其對於涉入更強烈的情緒表達有所畏懼或不信任，且可能有對情緒的限制。"],
["Finding4","CF + C + 1 ≤ FC ≤ 2(CF + C)<br>& C = 1","個體對情緒表達的調節或控制，於大部分時候與大部分成人相近，然而在某些時刻情緒表達的調節可能會失效。對於15歲以下者，此發現是很不常見的。"],
["Finding5","FC > 2(CF + C)<br>& C > 0","個體於大部分時候對情緒的表達嚴加管控，但嚴格的管控是容易失敗的。其經常有情緒的衝突，與此同時，情緒衝突容易損害其平常對情緒嚴格控制的功能。"],
["Finding6","CF + C + 1 ≤ FC ≤ 2(CF + C)<br>& C > 1","雖然個體努力嘗試於有效調節情緒釋放，但經常有嚴重的調節失敗。這對成人而言是很不尋常的發現，應再次審視其控制的議題。這對兒童青少年而言是常見的，因為他們仍在學習如何適切的調節情緒表達。"],
["Finding7","FC ≤ CF + C ≤ FC + 2<br>& C = 0 or 1","相較於大部分的成人，個體較不限制情緒的表達，傾向較一般人更為明顯或強烈的表達感受，這對沒有控制困難的人來說並非負向的發現。然而當個體有人際或現實感測試問題或經驗到情緒困擾時，這就可能是危險因素，因其可能造成情緒表達的程度不適切。雖然對兒童及青少年而言是常見的發現，但不論年齡，這對內向型因應風格者都是不常見的發現。"],
["Finding8","FC ≤ CF + C ≤ FC + 2<br>& C > 1","個體對情緒表達有潛在的嚴重調節問題，經常有過於強烈的情緒表達，且常給人留下衝動的印象。其問題除源自控制困難外，亦可能源自其不成熟的心理組織，當其中，情緒調節不被認為是重要的。此發現對兒童而言是常見的，這反映年輕者的情感豐富及對情緒有限的調節。但不論年齡，這對內向型因應風格者是不常見的發現，若有，應合理假設其思考風格的效能或整合性受損且可能經常受其他心理歷程干擾而短路。"],
["Finding9","CF + C ≥ FC + 3<br>& C = 0","相較多數人，個體較少調節情緒的表達，常因其感受表達的強度而引起別人注意。這不一定是危險因素，因其取決於情緒表達時其社交情境的接受度。然而當個體有現實感測試問題或經驗到情緒困擾時，其可能造成情緒表達不適切。這對兒童及青少年而言是常見的發現。"],
["Finding10","CF + C ≥ FC + 3<br>& C > 0","個體對情緒表達的調節非常鬆散，這常見於兒童，但不常見於成人，若為成人，常被他人視為是衝動的、情緒化的、或很不成熟的。若其同時有現實感測試問題或經驗到情緒困擾時，情緒調節失敗的後果可能經常對其社會適應造成非常負面的影響。當此發現於內向型因應風格者，可能反映其思考風格的效果及功能有嚴重問題。"]],
[["Finding","C > 0","若所有的 C 反應都具防衛或偽理智化，則在評估其是否有嚴重情緒調節問題時，C 應被視為與 CF 反應意義相近。<br>相反的，若有任一 C 反應具不成熟原始的 (如: 血液、火、器官組織) 品質，則 C 應被視為危險因素，此類反應顯示當調節失效時，行為結果可能不適切且不適應的(兒童除外)。"]],
[["Finding1","S < 3","無明顯發現"],
["Finding2","S = 3<br>& 所有 S 都在 CardI & CardII","顯示個體可能尚未準備好進行施測，而採較消極抗拒的策略應對情境需求，此反應應與目前測驗情境有關。"],
["Finding3","S = 4 or 5<br>& 所有 S 都在前三卡","顯示個體可能對於此次測驗情境感到相當惱火。當面對不想要的挑戰時，有極端對立的傾向；亦可能反應其面對權威而有的持續的消極抗拒態度。"],
["Finding4","S = 3<br>& 至少一個 S 出現於 CardII 之後","顯示相較於大部分人，個體對環境更顯消極抗拒或對立。這不算是危險因素，但可能不利於發展和諧的社交關係。"],
["Finding5","S ≥ 4<br>& 至少一個 S 出現於 CardIII 之後","個體呈現有大量的憤怒，通常憤怒是廣泛的，且對於個體對環境的態度有明顯影響，是一種影響個體心理功能 (如: 決策判斷、因應活動) 的特質。對某些人而言，憤怒特質會明顯且直接的呈現於其日常行為上；另一些人，憤怒的展現較為隱晦或不直接的，若同時有明顯的情緒壓抑特質，他很可能常生悶氣。無論憤怒如何被處理，他們通常難維持有意義的人際關係，因其難忍受社交關係中常有的妥協。若有情緒控制或調節問題，很可能在更強烈的情緒展現中包含了此種高度消極抗拒與執扭的態度。"]],
[["Finding1","Blends 比例介於平均","個體的心理複雜度與其因應風格相同之同儕相似。"],
["Finding2","Blends 比例低於平均","個體的心理複雜度較預期低，可能具較不成熟的心理組織，當其面臨複雜情緒刺激時常展現行為困難。"],
["Finding3","Blends 比例高於平均","個體的心理功能較預期更為複雜，且此些複雜度可能有情緒基礎 (確認多重決定因子中是否包含顏色或陰影反應)，若個體具有足夠資源因應複雜情緒經驗，就不會是一種危險因子。若當資源有限，或有情緒調節問題，則隨著心理複雜增加，亦加劇其對行為一致性或個體穩定性的有害影響。"]],
[["Finding","Blends (m) or (Y) > 1","扣掉所有 (但保留一個) 包含 m 及 Y 的 Blends 後，重新計算 Blends 比例，若新的 Blends 比例造成 Step12 所屬組別不同，則應重新解釋 Step12。並且，應合理推論個體因情境壓力造成心理複雜度較平時明顯增加，若情境壓力消退，則預期心理複雜度降低。"]],
[["Finding","3 個決定因子的 Blends > 25% R<br>or ≥ 1 個 Blends 含有 ≥ 4 個決定因子","應調整 Step12 的結論，個體的心理功能異常複雜，複雜度的異常提升幾乎總是來自情緒經驗，雖然這並不必然是危險因子，但當因應資源有限或有情緒控制或調節問題時，容易造成失功能。"]],
[["Finding1","(extratensive or ambitent)<br>& Blends (C.T or .V or .C') = 1","個體偶會對情緒或情緒情境感到不確定或混淆，這對外向型因應風格者而言並非必然為負面的發現，因為他們比起其他風格者更投入於感受，且更自在於面對情緒刺激，偶爾對感受不確定為其日常。"],
["Finding2","[(introversive or avoidant)<br>& Blends (C.T or .V or .C') = 1]<br>or [(extratensive or ambitent)<br>& Blends (C.T or .V or .C') > 1]","個體經常因情緒刺激或情緒情境而感到混淆，也常比其他人更加強烈地經驗感受，且有時更難以了結情緒情境。若此發現發生於內向型因應風格者或迴避因應風格者，此影響更加劇烈，因其較不習慣於處理感受，而更困難於尋找解決方案。"],
["Finding3","Blends (C.Y) > 0","個體對感受的不確定性或混淆亦可能源自情境壓力事件，這對內向型因應風格者或迴避因應風格者影響更為劇烈。若有 Finding1 或 Finding2，此項發現應作為補述。"]],
[["Finding","Shading Blends > 0","個體有非常痛苦的情緒，這對個體幾乎所有心理功能造成破壞性影響，此發現不僅影響情緒，更廣泛的影響其思考，注意力及專注度也常被影響，判斷力亦受到明顯影響。"]]]];

AllInfPro_Int =
[["Step1","Step2","Step3","Step3-2","Step4","Step5","Step6","Step7","Step8"],
[[["Finding1","Lambda < 1<br>& Zf 介於 9-13","個體投入於訊息處理的心力與大部分人相同。"],
["Finding1","Lambda < 1<br>& Zf > 13","個體較大多數人投入更多的心力處理墨跡刺激。"],
["Finding1","Lambda < 1<br>& Zf < 9","個體較大多數人投入更少的心力處理訊息。"],
["Finding2","Lambda ≥ 1<br> Zf 介於 6-10","個體投入於訊息處理的心力與大部分迴避風格者相同。"],
["Finding2","Lambda ≥ 1<br> Zf > 10","個體與大部分迴避風格者相比，投入更多心力以處理訊息，這是值得思考為何會如此。"],
["Finding2","Lambda ≥ 1<br> Zf < 6","個體與大部分迴避風格者相比，投入更少心力以處理訊息，顯示迴避風格的影響相當大，有限的心力投入於訊息處理可能造成潛在的適應問題。"]],
[["Finding1","W:D:Dd 介於預期比例<br>& Dd < 4","處理時投入的心力與策略使用與大多數人相似。此假設仍須經 Step3 以進一步確認。"],
["Finding2a","W 超出預期比例<br>(& Dd < 4)","個體較預期投入更多心力處理訊息，尤其當 W 反應超過 8 時。"],
["Finding2b","D 超出預期比例<br>(& Dd < 4)","個體傾向更節省心力於訊息處理，尤其當 D 反應 ≥ 2 倍 W 反應。"],
["Finding2c","Dd > 3","個體有較不典型的處理訊息方式，他會更加投入審視且關注於刺激上微小或不常見的特徵。以下三種解釋供參考<br>1. 有對完美主義的強迫傾向，使個體過度投注於刺激上微小不常見的特徵，他們通常會給較少的 W 反應 (比起 D 反應)，尤其當 OBS 為陽性時，因為他們經常對自身決策判斷能力感到不適，且對於處理較不複雜的刺激感到更為輕鬆。<br>2. 個體非常謹慎或多疑，對於任何知覺為模糊的刺激會試圖最小化其投入的心力，其中一種作法就是選擇對 Dd 區域反應，此發現常見於迴避風格者及 HVI 陽性者。<br>3. 消極抗拒態度者傾向過度使用空白區域納入反應 (造成Dd 反應增加)，他們可能有明顯的情緒混亂。"]],
[["Finding1","Step1 & Step2 發現一致","W 的序列應支持 Step1 & Step2 的兩項發現，若不支持，則 Step1 & Step2 兩發現皆應修正。<br>另，若 W & Dd 在所有卡中平均出現，則顯示其於處理訊息時的心力投入及習慣是規律且可預測的；若 W & Dd 出現的不一致，則顯示其心力投入與策略運用是不規律的。"]],
[["Finding2","Step1 & Step2 發現不一致","應依照 W 的序列判別 Step1 & Step2 何發現更為正確。<br>另，亦需同 Finding1 藉由 W & Dd 分析其心力投注及策略使用的規律性。"]],
[["Finding1","W 超出預期比例","個體具成就導向，且投入比起其可用資源更多的心力，若此傾向常見於日常行為，目標達成的失敗率將隨之提升，且容易有挫敗經驗。若 DQ+ 反應少便更支持此假設。<br>另，W 比例高，於兒童及青少年身上是常見的，他們經常高估自身能力，但他們也不會過度看重因此而來的挫敗，而較能因應。"],
["Finding2","W 低於預期比例","個體於設定目標時過於保守謹慎或省力，若 Zf 介於平均或高於平均，則應為過度保守謹慎地設定目標；若 Zf 低於平均，則可能於設定目標時傾向節省心力。"]],
[["Finding1","Zd 介於 -3 - +3","個體審視刺激的效率與大多數人相近"],
["Finding2","Zd < -3","(合併過少) 個體傾向隨意草率的審視刺激，且常忽視刺激中的重要線索，這在未達 10 歲的幼兒身上是常見的發現，但對於稍長的兒童及成人，這可能是危險因素，因其可能會造成對線索的轉譯錯誤，導致較不有效的行為模式。這通常可以透過延宕且完整審視刺激等認知重構方式改善。"],
["Finding3","Zd > 3","(合併過多) 個體傾向投入更多 (多於情境所需) 的心力於審視刺激，希望避免粗心，雖然可能較沒有效率，但由於完整審視時通常能確保所有刺激線索都被納入考慮，因此它常是優點。但當心理組織混亂時，它便可能成為危險因素，因其傾向誇大此種處理風格並在決策判斷時造成不必要的猶豫。"]],
[["Finding1","within Card PSV = 1","個體可能有些困難於注意力轉移，這可能造成較低的處理效率。"],
["Finding2","within Card PSV > 1","個體呈現有嚴重的注意力轉移困難，這通常只出現在非常小的幼童、非常嚴重的心理混亂、有神經相關的問題。若有此發現，應納入羅夏克以外資訊以更仔細評估其認知功能。"]],
[["Finding1","DQ+ 介於預期範圍<br>& (DQv + DQv/+ ≤ 1 for introversive, ambitent style<br>or DQv + DQv/+ ≤ 2 for extratensive style)","個體處理訊息的品質是相當適切的。"],
["Finding2","DQ+ 介於預期範圍<br>& (DQv + DQv/+ > 1 for introversive, ambitent style<br>or DQv + DQv/+ > 2 for extratensive style)","個體處理訊息的品質通常是適切的，然有時訊息處理歷程不適切或較不成熟，這使其對輸入的刺激的轉譯鬆散或有缺陷，亦可能為適應困難的前驅因子。"],
["Finding3","DQ+ 超過預期範圍<br>& (DQv + DQv/+ ≤ 1 for introversive, ambitent style<br>or DQv + DQv/+ ≤ 2 for extratensive style)","個體處理訊息的品質是相當好的且複雜的。雖然這通常出現於教育良好的受測者的反應中，但這並表示其具更有效的適應或認知，僅說明其對輸入刺激的處理有較高的品質。"],
["Finding4","DQ+ 超過預期範圍<br>& (DQv + DQv/+ > 1 for introversive, ambitent style<br>or DQv + DQv/+ > 2 for extratensive style)","個體處理訊息的品質通常是相當好的且複雜的，然有時處理品質會變得有缺陷或不成熟，且對輸入刺激的轉譯及概念化歷程產生潛在問題，這常見於有明顯可見的心理混亂者。"],
["Finding5","DQ+ 低於預期範圍<br>& (DQv + DQv/+ ≤ 1 for introversive, ambitent style<br>or DQv + DQv/+ ≤ 2 for extratensive style)","個體處理訊息的品質可能適切，但較一般人更顯保守及省力。這常見於迴避型風格者，且顯示此風格主導其心理活動。"],
["Finding6","DQ+ 低於預期範圍<br>& (DQv + DQv/+ > 1 for introversive, ambitent style<br>or DQv + DQv/+ > 2 for extratensive style)","個體處理訊息的品質通常較不適切，尤其當面對複雜情境時，此種鬆散或缺陷的處理品質通常會造成適應困難。"]],
[["Finding","依 DQ 序列判斷","依 DQ 序列判斷下列各項發現，當此步驟的發現與前面步驟發現有矛盾，宜依此步驟為依據調整先前步驟的假設。<br>1. 於 Card II, III, VII, VIII, X 給出 DQ+ 反應是比較容易的; 於 Card I, IV, V, VI, IX 給出 DQ+ 反應則是比較需要投入心力的，宜依此判斷個體於訊息處理時投入心力的多寡的傾向<br>2. 經常於卡的第一個反應給出 DQ+ 者，通常訊息處理品質較好，但並非表示其處理較有效率，而是他們習慣於進行高品質的處理。當習慣於卡的最後反應給出 DQ+ 者，通常傾向堅持持續作業到刺激被徹底審視或組織為止，這是個好的特質，但同時顯示當其於如常情境中處理新資訊時，較不習慣追求較高的處理品質。<br>3. 當大部分 DQ+ 反應包含空白處 (S)，雖然這也反應出處理品質高，但同時也顯示高品質處理僅出現於對環境帶有負向或敵意態度時。<br>4. 當卡的第一個反應給出 DQv 時 (尤其超過一次)，可能顯示<br>4-1. 個體呈現有，於完好圖像被形塑及審視前，便即急於決策的一種認知衝動。<br>4-2. 個體可能存有些困難於在短期記憶中創造或維持圖像，此類人通常亦具維持注意力的問題。<br>5. 當 DQv 常出現於卡的中或後段反應時<br>5-1. 通常顯示個體因既存於腦中的圖像及與之相關的作業需求，而感到困惑、不滿足、挫折或甚至感到受威脅，因此尋求改變圖像。有時處於此狀態的個體，會轉卡並形成新的圖像，這比起直接給出 DQv 反應是更細緻的處理此狀態的方式，因中後段的 DQv 反應是犧牲前段投入的處理心力，以分散地重構既存圖像使得邊界不再被重視的作法。<br>5-2. 個體可能困難於在短期記憶中維持圖像，這通常不常見，除非個體有明顯認知或神經缺陷，若是，DQv 可能大量頻繁出現於整體紀錄中，且有明顯的混亂特徵。"]]]];

AllCogMed_Int =
[["Step1","Step2","Step3","Step4","Step5","Step6","Step3a"],
[[["Finding1","XA% 介於 0.78 - 0.9<br>& WDA% ≥ XA%","認知中介 (mediation) 的轉譯 (現實感測試) 通常適切於情境，表示現實感測試所需的基本要素是完整的。"],
["Finding2","XA% > 0.9<br>& WDA% ≥ XA%","顯示個體特別投入心力以確保認知中介 (mediation) 的轉譯 (現實感測試) 適切於情境，即個體受正確轉譯情境的傾向影響其認知中介活動，這常見於具強迫風格者。"],
["Finding3","XA% ≥ 0.78<br>& WDA% < 0.75","這是非常罕見的發現，很可能是算錯。若沒算錯，可能反應過少 (R ≤ 16)，且有大量 Dd 伴隨 FQo 或 FQu 反應，且大部分 W & D 反應之 FQ 編碼為 - 或無編碼。這可能反應處理問題，但也可能發生在個體企圖偽裝嚴重混亂時。"],
["Finding4","XA% 介於 0.7 - 0.77<br>& WDA% ≥ 0.8","在情境明確時認知中介 (mediation) 的轉譯 (現實感測試) 一般是適切的，但在其他情境下傾向變得不適切。通常情緒或意念的干擾會造成中介的效果不佳，進而導致辨認錯誤。FQnone & FQ- 反應通常會為此發現提供證據。"],
["Finding5","XA% < 0.7<br>& WDA% ≥ 0.8","當需要被適切轉譯的線索不明顯時，認知中介 (mediation) 的轉譯 (現實感測試) 容易有明顯動盪不穩。此發現通常源自於 Dd 區域上錯誤辨認的反應數量，Dd 並不表示省力的處理，而是反應因防衛、不尋常的細節關注、消極抗拒而對既存圖像重構的心理歷程。應可從 FQnone & FQ- 反應中得到關於中介效果受干擾的訊息。"],
["Finding6","XA% 介於 0.7 - 0.77<br>& WDA% 介於 0.75 - 0.79","認知中介 (mediation) 的轉譯 (現實感測試) 有相當程度的失功能。通常 Dd 越多容易造成 XA% 下降，但不影響 WDA%。然而當 WDA% 同時很低時，表示在常見反應區域 D 及 W 上每 5 個反應就有 1 個是扭曲或忽略刺激上明顯特徵的，這反映出現實感測試的問題。通常情緒或意念的干擾會造成此發現，W 及 D 區域上的 FQnone & FQ- 反應應能對認知中介的受損提供一些看法。"],
["Finding7","XA% < 0.7<br>& WDA% < 0.75","認知中介 (mediation) 的轉譯 (現實感測試) 嚴重受損。當 WDA% 介於 0.65 - 0.74，失功能是嚴重的且現實感測試會明顯受影響；當 WDA% 低於 0.65，失功能是極為嚴重的且現實感測試會明顯受損。這常見於精神病般的處理歷程，但宜先留意後續步驟再解釋精神病般特徵。<br>當 XA% 與 WDA% 差距 ≥ 0.1，顯示失功能較常出現於環境中需被轉譯的線索較不明顯時。當 XA% 與 WDA% 差距 < 0.1，則表示轉譯功能受損是全面的，不論線索是否明顯。"]],
[["Finding","FQnone ≥ 2","認知中介的效果受其意念 (MQnone) 或強烈情緒 (其他 FQnone) 阻礙"]],
[["Finding1","X-% < 0.15","失功能的認知中介發生的頻率與大多數人相同。另需檢查是否有 S-，若有，則這些偶發的失功能可能源自其消極抗拒或憤怒。"],
["Finding2","X-% 介於 0.15 - 0.2","認知中介失功能發生的頻率屬中度。另需檢查 S- & Dd 上的 FQ- 的頻率，若多數為 S- ，則失功能可能源自其消極抗拒或憤怒；若多數是 Dd 上的 FQ-，則失功能可能源自訊息處理歷程的問題。"],
["Finding3","X-% 介於 0.21 - 0.25","認知中介失功能是廣泛發生的。另需檢查 S- & Dd 上的 FQ- 的頻率，若頻率高則不宜直接斷定其失功能是廣泛的，而需進一步理解此失功能與其消極抗拒或憤怒間的關聯，或與訊息處理歷程問題的關聯。"],
["Finding4","X-% > 0.25","呈現嚴重且廣泛的認知中介受損，適切現實感測試所需的基本要素有嚴重受損。"],
["Finding5","X-% > 0.7","個體很可能有誇大症狀或詐病的可能。若非誇大，則個體應不太可能可以受測，通常近期有急性精神病般狀態的病史得以佐證，若無一致的病史證據支持，則應為詐病。"]],
[["Finding1","Popular 介於平均","當預期或被廣納的反應的線索明顯時，個體傾向給出這些常規反應。即使有些訊息處理問題，在簡單或明確定義的情境下，給出較不常規的反應的機率仍低。"],
["Finding2","Popular 超過平均","個體過度關注於常規或正確性，可能過度投入於尋找與社會預期或接納的行為有關的線索，常見於有強迫風格者，亦可能有完美主義傾向。這不是危險因素，但衍生了個體是否過度關注社會接納度的問題。"],
["Finding3","Popular 低於平均","即使在簡單或明確定義的情境下，個體仍傾向較不墨守成規而較個人化的反應。這不是危險因素，但這衍生了關乎於個體是否較服膺個人需求或想望，而傾向忽視社會規範或期許的問題。"]],
[["Finding1","FQ+ = 0","無特別發現。但當個體受良好教育或可能智力高於平均，應再次回顧是否有 FQ+，此類人沒有給出任一 FQ+ 可能顯示草率、防衛、或甚至認知中介受損。"],
["Finding2","FQ+ 介於 1 - 3","個體傾向於精細地轉譯輸入刺激，且具良好受測動機。"],
["Finding3","FQ+ > 3","個體有明顯精確或正確導向的反應傾向，這不必然是危險因素，但確實顯示個體可能過度謹慎於決策判斷，若此發現出現於強迫風格者上，則顯示其於認知中介更顯完美主義的傾向。"]],
[["Finding1","X+% 介於 0.7 - 0.85<br>& Xu% 介於 0.1 - 0.2","個體有較強的傾向於形成符合社會需求或期許的行為。若 Xu% < 0.1，顯示認知中介失功能偶會干擾此傾向。"],
["Finding2","X+% > 0.85","個體過於墨守成規。這不必然是危險因素，但顯示個體可能過度關注於社會接受度，而導致犧牲個人性，亦可能反映其具強迫傾向或完美主義。"],
["Finding3","X+% 介於 0.55 - 0.69<br>Xu% ≥ 0.2","顯示個體相較大多數人，於轉譯時傾向忽視社會需求或期許，這可能源自與環境間的價值衝突。無論成因，此發現顯示個體有更為頻繁的非常規行為，但這不表示行為必然是不被接受或反社會的，只是比起大多數人更為強調個人主義。<br>若 Lambda > 0.99 (迴避型風格)，個體可能呈現社會疏離或防衛，傾向避免常規，藉此與被知覺為威脅、苛求、不讓步的環境保持距離"],
["Finding4","X+% < 0.55","當 X-% > 0.2，可能高機率呈現有非典型或不適切的行為，非常規的行為可能源自認知中介失功能及現實感測試的問題，此時解釋應著重於此，而非其關注個人主義的傾向。<br>當 X-% ≤ 0.2，Xu% 則應 ≥ 0.25，這顯示許多認知中介決策是不遵循常規的，這並不是現實感測試問題，因其雖不尋常，但仍適切於其所屬情境。其可能不太受社會需求或期許影響，這並不必然是危險因素，然此類非常規行為的有效性大大取決於其創造力及其所屬環境對個人主義的彈性。"]],
[["Finding1","所有 FQ- 都在前三卡","認知中介失功能可能是對施測情境的反應，可能不了解測驗的本質且感到焦慮，或對施測帶有負面態度 (尤其有 S- 時)。無論何者解釋，失功能都是暫時的，可能可從個人史可觀察到，其於不熟悉或有不想要的要求的情境，容易有此失功能表現的慣性模式。"],
["Finding2","大部分 FQ- 都在彩色卡 (Card VIII, IX, X)","認知中介失功能可能源自情緒混亂。通常 FQ- 的決定因子包含 C, C', T, V, Y。"],
["Finding3","大部分 FQ- 有運動決定因子","現實感扭曲可能源自某種怪異思考。<br>若 M- ≥ 2，且佔大部分的 FQ-，顯示雜亂失序的思考影響其認知中介。<br>若 FM-, m- 佔大部分的 FQ-，顯示因需求或壓力經驗引起的次要心智活動，干擾其注意力及專注度並侵入其邏輯思考，進而干擾其認知中介的效果。"],
["Finding4","大部分 FQ- 有 rF, Fr, 或 FD 決定因子","認知中介的干擾可能與自我意象議題有關。"],
["Finding5","FQ- > 3<br>& 幾乎所有 FQ- 為 F 決定因子","若 Lambda > 0.99，顯示迴避型風格是無效的，並且因現實扭曲而維持此風格。<br>若 Lambda < 1，顯示更為刻意防衛的現實扭曲，這是一種策略，為了避免處理情境中明顯的現實而刻意扭曲它。"],
["Finding6","大部分 FQ- 有同種類的內容","(此發現需自行判斷)<br>顯示個體過度關注於特定內容造成認知中介失功能。"],
["Finding7","FQ- > 3","(此發現需自行判斷)<br>當幾乎所有 FQ- 都是卡的第一反應，顯示其草率或倉促於認知中介，可能衝動於訊息轉譯 (尤其當後續反應 FQ 都適切時)<br>當幾乎所有 FQ- 都是卡的最後反應，則有以下兩種可能<br>(1) 這些反應對個體有特殊重要性，且當回顧反應的特徵或內容時會特別顯露。<br>(2) 個體傾向誇大困擾，尤其當所有 FQ- 都在卡的最後反應。"],
["Finding","FQ- ≥ 1","(此發現需自行判斷)<br>FQ- 反應仍有程度差異。<br>中度扭曲程度者，可能尚有部分形狀符合墨跡刺激邊界而尚能輕鬆辨認<br>較嚴重扭曲者，可能大部分形狀符合墨跡刺激邊界，但有重要部分明顯不適切於墨跡刺激<br>極端嚴重扭曲者，幾乎完全忽視墨跡刺激以形成反應，其反應明顯偏離現實，他人完全無法辨認其反應。<br><br>只要有任一 FQ- 有嚴重扭曲的現象，則應補述個體有與認知中介有關的認知活動崩解，某些行為會明顯偏離情境的要求，這常見於精神病般的認知活動。越多 FQ- 有嚴重扭曲，則認知中介呈混亂崩解以致無可避免的肇生無效及不適切的行為。"]]]];

var AllIde_Int =
[["Step1","Step2","Step3","Step5","Step6","Step7","Step8","Step9","Step10","Step11","Step4"],
[[["Finding1","Introversive Style","個體十分仰賴概念思考，傾向審慎思考並考量完諸多可能性後才行決策。他們傾向相信內在評價多過外在反饋，並嘗試避免受情緒過度影響。進行決策時，很謹慎且追求精確邏輯，並避免投入試誤行為。當個體的思考是有邏輯的、清晰的、一致的，且當情境更適合直覺或試誤策略時，能有足夠彈性調整至相應策略，則此基礎因應風格於應對日常需求是相當有效的。"],
["Finding2","Avoidant-Introversive Style","雖個體傾向考慮所有可能後再做決定，但迴避風格的主導經常造成處理歷程較不徹底且概念思考可能顯得簡單。雖然在問題解決或決策判斷時，傾向不將情緒納入思考歷程，且在如常及明確的環境中是有效的因應風格；但當面對複雜或模糊情境時，卻容易受到情緒入侵而干擾其思考。他們偏好不複雜的邏輯思維，且盡可能迴避試誤式的探索。"],
["Finding3","Extratensive Style","個體於問題解決及決策判斷時，傾向將感受結合進思考之中，且更為依賴感受。這並不表示他們較內向型風格者在思考上更不一致或缺乏邏輯，但情緒對意念的影響經常使思考模式更顯複雜。他們傾向接受較不精確或較模糊的邏輯系統，亦更仰賴外在反饋及試誤行為以利形成判斷。當思考是清晰且一致，並且不會過度受制於情緒或直接被強烈情緒影響時，此種更為直覺的風格是十分有效於因應日常。"],
["Finding4","Avoidant-Extratensive Style","個體於問題解決及決策判斷時，十分傾向於使用情緒並受其影響，亦非常仰賴外在反饋，且經常投入試誤行為。然而迴避風格的主導，使其更難完整釐清情緒經驗，且使感受經常過度影響其思考。當環境是可預測、不複雜、且感受表達更被接納甚至被鼓勵時，此種風格者通常能適切運作；然當其對於感受調節變得草率時，容易呈現有衝動思考，這經常造成有缺陷或過於簡單的邏輯，進而容易導致無效或甚至不適切於情境的決策或行為。"],
["Finding5","Ambitent Style","個體的意念思考活動 (如問題解決或決策判斷) 是較難預測的 (即使在相似的情境下)。有時如內向型般不納入感受於思考中，且傾向考慮周全後再行決定；有時則如外向型般更顯直覺，且思考時仰賴感受並受感受影響。此種於概念化及決策時的不一致可能減低效率，因此容易有錯誤判斷，且更可能反悔先前的決定。他們顯得更難從錯誤中學習，通常需要更多的時間以達到有效解方。這並不直接導致適應問題，但不一致的思考可能是危險因素，因其需要更多時間及心力以面對日常需求。"],
["Finding6","Avoidant-Ambitent Style","個體傾向迴避複雜情境，同時具有不一致的概念思考，這造成思考更顯無效。其容易有不精確的思考，且進行思考活動時常難調節情緒的影響，使其於複雜環境中難有效適應。"]],
[["Finding1","introversive style<br>& EBPer < 2.5","個體通常深思熟慮後才決策，但有時感受也於思考中扮演重要角色，即意念活動的彈性較佳。"],
["Finding1","introversive style<br>& EBPer ≥ 2.5","個體幾乎都是深思熟慮後才決策，即使直覺或試誤方式更適合於目前情境，情緒感受仍於思考中扮演相當有限的角色，即意念活動較不彈性。"],
["Finding2","extratensive style<br>& EBPer < 2.5","個體傾向將感受納入思考中，但有時亦能將感受暫行擱置，而轉向更深思熟慮的思考方式，即意念活動的彈性較佳。"],
["Finding2","extratensive style<br>& EBPer ≥ 2.5","個體幾乎都將感受納入思考之中，即使此類直覺方式較不利於目前情境，感受對思考的影響仍非常廣泛且重大，即意念活動較不彈性。"]],
[["Finding1","a + p = 4<br>& (a = 0 or p = 0)","相較大多數人，個體的態度及價值更顯不彈性。"],
["Finding2","a + p > 4<br>& (2*p < a ≤ 3*p<br>or 2*a < p ≤ 3*a)","個體的意念結構及價值觀是固著且難以改變的。"],
["Finding3","a + p > 4<br>& (a > 3*p or p > 3*a)","個體的意念結構及價值觀是極為固著且難以撼動的，他們非常難改變態度或看法，或難調整對特定議題的觀點。"]],
[["Finding1","L-eb 介於 3 - 6<br>& m > FM","周圍的思考因情境相關壓力而增生。<br>若 FM < 2，顯示個體弱化或迴避許多因內在需求產生的心智活動，當經驗到內在需求時，傾向快速採取行動以減低之；有些人發展出思考策略以將周圍思考防衛性的融入更高度控制的思維裡，藉此暫時減低需求的影響，即使這將使需求持續且可能越加增強。"],
["Finding2","L-eb < 3","一般來說這是不常見的，但較常見於迴避型風格者。若為迴避型風格者，個體可能傾向快速採取行動以減低因周圍思考入侵而造成的激躁 (尤其當 FM ≤ 1)，此策略可能短期有適應性，然倉促形成反應經常是沒有深思熟慮的，因而長期而言效果有限。若非迴避型風格者，個體可能防衛性的將周圍思考融入更為控制的概念思考框架中。"],
["Finding3","(L-eb = 7 & m ≤ 1)<br>or (L-eb > 7 & FM > 5)","內在需求狀態造成個體經驗到大量的周圍心智活動，通常這是長期慢性的，並且會頻繁干擾注意力及專注度。<br>若 m > 2，顯示此些周圍心智活動亦因情境相關壓力而增加。"],
["Finding4","(L-eb = 7 & FM ≤ 4)<br>or (L-eb > 7 & FM ≤ 5)","個體因情境相關壓力而經驗到明顯周圍心智活動增加。一般來說這是暫時的，然而重要的是，在此情境壓力期間注意力及專注活動會被嚴重干擾。"]],
[["Finding1","Mp ≥ Ma + 1","個體較多數人更傾向於壓力情境中防衛式地以幻想思考取代現實思考。這可以是非常有效的防衛策略，且不應被看作危險因素，除非有其他證據顯示個體明顯過於依賴他人。若個體傾向過於依賴他人，則濫用幻想只會加劇依賴傾向。"],
["Finding2","Mp ≥ Ma + 2","當面對不喜歡的情境時，個體遁入幻想的防衛方式已成為其常規應對策略，會過度濫用幻想以否認現實，也常導致結果與其自身需求相悖而適得其反。這有時又被稱為公主病 (Snow White Syndrome)，主要呈現有迴避責任與決策的特徵。由於需依賴他人，此種因應方式會將自己深陷無助感中，也容易受他人操弄。此種因應對於內向型風格者影響尤深，因當情境複雜或具潛在壓力時，其往往放棄意念思考而轉向依賴傾向。"]],
[["Finding1","Intell Index 介於 4 - 6","較多數人更傾向將感受理智化，表示個體可能會採取或接納扭曲現實的概念思考，此些思考能夠否認情境對感受造成的實際影響。"],
["Finding2","Intell Index > 6","當面對壓力情境時，個體使用理智化作為主要的防衛策略，但這是虛假的智力歷程，它取消或否認感受，也減少了感受被直接或更切實際地處理的機會。此類人很容易接受扭曲的概念思維，當情緒經驗強烈時，將使其意念結構混亂，因為隨著壓力刺激漸增，其理智化策略的效果會變得越差。"]],
[["Finding1","WSum6 ≤ 6<br>& 僅為 Mild (DV1, INC1, DR1)","無明顯發現，沒有理由質疑其概念思考的清晰度。"],
["Finding2","WSum6 ≤ 6<br>& 包含 FAB1 或 ALOG<br>但不包含 CONTAM 及 level 2","顯示其思考比平常更容易有明顯誤判或意念上失誤的傾向，這並不一定表示思考有問題，但顯示思考較不清晰，且有些概念化較平常是較不成熟或不精確的。"],
["Finding3","[(R ≥ 17 & WSum6 介於 7 - 10)<br>or (R ≤ 16 & WSum6 介於 7 - 9)]<br>& 不包含 CONTAM 及 level 2","意念活動較平常有更多誤判或意念上失誤，這並不一定表示思考有問題，但顯示思考較平常更顯不清晰及明顯不精確的。"],
["Finding4","(R ≥ 17 & WSum6 介於 11 - 17)<br>or (R ≤ 16 & WSum6 介於 10 - 12)","有嚴重思考問題，意念不連續或錯誤概念化會干擾其思考或造成錯誤判斷。"],
["Finding5","(R ≥ 17 & WSum6 > 17)<br>or (R ≤ 16 & WSum6 > 12)","思考受到嚴重干擾，此時現實感測試亦不好，思考傾向混亂、不一致、判斷有缺陷。常有怪異的概念化，此類人通常無法有效應對日常生活需求。"]],
[["Finding1","M- = 0<br>& Mnone = 0","無明顯異常發現。"],
["Finding2","M- = 1<br>& Mnone = 0","因成見干擾認知中介或思考清晰度，而造成有些思考怪異。某些例子亦可能呈現有意念思考混亂，若此為真，通常特殊分數幾乎都會有明顯異常發現。"],
["Finding3","M- = 0<br>& Mnone = 1","常有意念控制問題，而造成對思考清晰度的干擾。Mnone 通常伴有情感成分 (如難過、憤怒等)，但有時是更為深奧的 (如有創造力)。前者易受感受淹沒其思考，導致與現實抽離；後者意念變得流動，且內在成見疊加於現實之上或取代現實。兩者皆顯示對思考的控制能力受損，然更為深奧的 M- 反應可能涵蓋與幻覺經驗相似的歷程。"],
["Finding4","M- + Mnone ≥ 2","思考很可能是怪異或受干擾的，可能表徵其意念混亂，可由 WSum6 的明顯增加佐證。"]],
[["Finding","M > 0","當 M 反應之概念品質是一般的或精細的，這是正向發現，亦應補述於「意念」向度的結論中。<br>若有 ≥ 1 個 M 有較為幼稚的概念化，則可推論其思考較不成熟，這常見於兒童及青少年的反應中，若青少年的 M 反應無此特徵，則可推論其思考較其同年齡同儕更顯成熟。<br>M 反應不被預期會具有原始形式的概念化特徵 (除 9 歲以下者)，具原始特徵的 M 反應通常會很突兀，且常包含 ≥ 1 個特殊分數。此類反應顯示其思考品質相當固化且不成熟，亦可能反映出思考受到極巨侵入性的成見干擾而受損。"]],
[["Finding1","基於 (1)","當大部分特殊分數源自其所屬文化 (或與其教育背景相似) 之語用，或為其長久以來的字詞選用問題，則思考上的失誤應為暫時的，Step 8 的發現亦應隨之調整。"],
["Finding2","基於 (2)","雖沒有任何特殊分數含有怪異內容，但許多反應出與其年齡不符的缺陷或不成熟的邏輯，若此為真，則 Step 8 應加註無法適應性地主導意念，且概念化歷程容易受錯誤邏輯或判斷影響。"],
["Finding3","基於 (3)","ALOG、CONTAM、Level 2 的怪異干擾思考應有近期行為病史佐證，若回顧近期病史卻無相應發現時，則應考慮誇大症狀或詐病的可能。"]],
[["Finding1","OBS: Yes","(obsessive) 個體具關乎於正確性或完美主義的心智結構，傾向謹慎於概念形成，表達自我時傾向話多，這可能顯示其因追求精確而有的概念思考的複雜度。此種思考方式需要更多的意念活動與心力，可能較無效率，但不應視為危險因素，除非有明顯的證據顯示其思考是不一致、多餘、或明顯的失誤 (如不適切的字詞使用、奇怪的表達、難結束)。"],
["Finding2","HVI: Yes","(hypervigilant) 呈現過度警戒，即耗費大量精力以持續維持於準備狀態。此過度警覺可能與發展階段形成的對環境有負面或不信任的態度有關，應是由事件的累積形成，在這些事件中，青少年發現他們很難準確預測重要他人對他們的行為 (尤其情緒行為) 的反應，這導致不安全感及脆弱性，以及當形塑或採取行動時越顯謹慎，然後逐漸發展出對個人空間的過度關注及對人際關係非常防衛。另，他們並不預期親密關係，且經常對他人的親密舉動感到混淆及疑心。過度警覺容易造成概念思考不清晰、更不彈性、更不邏輯，這不是病理狀態，但若越顯過度時，其思考經常會包含非常明顯的偏執 (paranoid) 特徵。"],
["Finding3","MOR ≥ 3","個體之概念思考呈現有明顯悲觀特徵，隨 MOR 越多，悲觀對思考的影響越大，可能造成個體以懷疑及沮喪的感受來概念化他與世界的關係，亦導致其對自身努力有悲觀結果的預期，無論其努力的品質如何。悲觀經常導致狹隘或固化的思考模式，邏輯缺陷或錯誤判斷常被忽視，即使個體已覺察到它們。整體而言，悲觀可明顯降低概念思考的品質，且有時造成非常混亂的意念。"]]]];

var AllSelPer_Int =
[["Step2","Step3","Step4","Step5","Step6","Step7a","Step7b","Step8","Step1"],
[[["Finding","Fr+rF > 0","有過度的自我涉入及膨脹的自我價值感，此些感受往往會主導個體對世界的知覺。這是會高度影響個人決策及行為的基礎人格特質，因其誇大的自我價值感有頻繁被肯定或增強的需求。他們通常難建立並維持有深度及意義的人際關係。有時此特質會造成自我審視並進而產生內在衝突，這可能包含「高度自我價值」與「此自我價值可能無效」此二者間的衝突。當環境無法給予其對於自我價值感的再保證，則反社會的心理歷程容易因此萌生。"]],
[["Finding1","Ego Index 高於平均","個體較他人更傾向於投入於自我。若同時 Fr+rF ≥ 1，顯示自戀特質很深的嵌入其心理結構，且會保持更有利於自身而非利於他人的判斷。若 Fr+rF = 0，則顯示有不尋常的自我關注，進而容易導致忽略外在世界。雖 Ego Index 常與高自我價值有關聯，但有時此高度自我關注亦可能會造成個人的不滿足感，若此為真，則於其整體反應當中通常會包含自我貶抑或社會適應問題的證據。"],
["Finding2","Ego Index 介於平均","個體與大多數人之自我關注程度相似。"],
["Finding2a","Ego Index 介於平均<br>& Fr+rF ≥ 1","個體有自戀特質，然同時對於「高度自我價值可能有誤」有所覺察，此時產生自我懷疑也是常見的。這在青少年身上是好的發現，因這顯示他們正經歷社會適應的歷程；但對成人而言不是正向的發現，因為對誇大自我價值的挑戰，通常會誘發防衛機制的使用，而這是在過往已被增強的防衛機制，這可能導致更為混亂且無效的心理功能，而情緒浮動也不罕見。"],
["Finding3","Ego Index 低於平均","個體有負面的自我價值感，當與他人相比時更傾向看低自己，這通常是憂鬱症的前置因子。<br>此時若 Fr+rF ≥ 1 是不尋常的，這顯示個體對自我意象及自我價值有嚴重衝突，情緒動盪及行為失功能的可能性極大。"]],
[["Finding1","R ≥ 17<br>& FD = 0<br>& SumV = 0","個體較大多數人少投入自我覺察，且對自我概念過於天真，這常見於兒童青少年。"],
["Finding2","SumV = 0<br>& FD = 1 or 2","個體經常自我省思，這通常是正向發現，因為此歷程往往促使個體再評估自我意象。"],
["Finding3","FD > 2<br>or SumV > 0","有不尋常的自我內省行為。<br>FD ≥ 3 & SumV = 0，顯示對自我意象不尋常的關注。若這是關乎於努力讓自己更好的話，則自我關注是正向的 (尤其當 Ego Index 介於平均)。若這僅是對自我的反芻，則反而是適得其反 (尤其當 Ego Index 低於平均)。<br>SumV > 0 (不論 FD 的次數)，顯示自我關注是負面的，且造成痛苦感受。這在某些生命階段是常有的，如青春期、老化、重大生命事件 (如: 失落、挫敗、身體心理困擾)。<br>Fr+rF > 0 (於此發現中是罕見的)，若有，則顯示有嚴重的自我意象衝突，個體明顯來回周旋於「高度自我價值」及「對自我負面特徵覺察」之間。"]],
[["Finding1","An+Xy = 2","個體可能呈現有身體關注，這不應被視為個體心理組織的重大問題，除非該反應為 FQ- 或有 MOR 特殊分數。"],
["Finding2","An+Xy ≥ 3","個體明顯有不尋常的身體關注，這常見於有身體問題者，若沒有身體健康問題，則可能有對身體或自我意象的反芻，可能顯示了一種令人不安的脆弱感受。"]],
[["Finding1","MOR = 2","自我概念中涵蓋的一些負面特徵可能促成對自我感到悲觀。<br>Fr+rF > 0 (於此發現中是不常見的)，顯示有內在自我價值感的衝突，且可與近期知覺到的高價值自我意象受貶低的相關壓力事件有所呼應。"],
["Finding2","MOR ≥ 3","個體於自我意象上有明顯負向歸因，對自我更顯得悲觀。<br>Fr+rF > 0 (於此發現中是非常罕見的)，可能呈現有自我意象及自我價值相關的明顯內在衝突，也可能盡力在誇大痛苦或無助感的意象。"]],
[["Finding1a","introversive style<br>& H ≥ Hd+(H)+(Hd) + 2","個體的自我意象是基於現實經驗而非幻想，顯示社交互動應對於形塑自我意象有重大貢獻，然而此發現不表示其自我意象或自我價值是準確或現實的。"],
["Finding1b","not introversive style<br>& 17 ≤ R ≤ 27<br>& H ≥ Hd+(H)+(Hd)","個體的自我意象是基於現實經驗而非幻想，顯示社交互動應對於形塑自我意象有重大貢獻，然而此發現不表示其自我意象或自我價值是準確或現實的。"],
["Finding1c","not introversive style<br>& (R < 17 or R > 27)<br>& H ≥ Hd+(H)+(Hd) + 1","個體的自我意象是基於現實經驗而非幻想，顯示社交互動應對於形塑自我意象有重大貢獻，然而此發現不表示其自我意象或自我價值是準確或現實的。"],
["Finding2a","introversive style<br>& H < Hd+(H)+(Hd) - 2","個體的自我意象及自我價值大多基於幻想，或基於對現實經驗的扭曲，常更顯不成熟且對自我意象扭曲，此有限的自我覺察經常導致非常負面的決策判斷及問題解決，並且造成與他人互動聯繫的困難。"],
["Finding2b","not introversive style<br>& 17 ≤ R ≤ 27<br>& H < Hd+(H)+(Hd)","個體的自我意象及自我價值大多基於幻想，或基於對現實經驗的扭曲，常更顯不成熟且對自我意象扭曲，此有限的自我覺察經常導致非常負面的決策判斷及問題解決，並且造成與他人互動聯繫的困難。"],
["Finding2c","not introversive style<br>& (R < 17 or R > 27)<br>& H ≤ Hd+(H)+(Hd) - 1","個體的自我意象及自我價值大多基於幻想，或基於對現實經驗的扭曲，常更顯不成熟且對自我意象扭曲，此有限的自我覺察經常導致非常負面的決策判斷及問題解決，並且造成與他人互動聯繫的困難。"]],
[["","","當人類反應中包含以下，則應考慮相應可能:<br>FQ-: 對自我意象有困惑或扭曲。<br>特殊分數 (不尋常的語言表達): 關於自我的思考有扭曲。<br>特殊分數 (MOR): 對自我有毀壞感。<br>Hx: 傾向過於以理智化方式處理自我意象或自我價值的議題，而可能忽略現實，尤其當同時包含 AB 特殊分數，此時常有意念上的衝動控制問題，可能導致許多自我意象特徵有重大扭曲。<br><br>以下整理反應的正負向編碼特徵，解釋人員宜參照每個包含人類內容的反應所有的編碼，並統整對自我意象的解釋<br>正向: (位置) 無 S 的 W, D; (FQ) +, o; (決定因子) M in H, FC; (特殊分數) COP<br>負向: (位置) Dd, WS, DS; (FQ) -; (決定因子) M in Hd, pure C, Shading, C', color-shading blend, shading blend; (內容) An, Bl, Ex, Hx; (特殊分數) COP 以外的特殊分數，尤其 MOR, AB, INCOM, FABCOM, ALOG, CONTAM"]],
[],
[["Finding1","OBS: Yes","(obsessive) 個體具完美主義，重視正確性或精確性。他們因質疑自身能力而懷有不安全感，而追求完美可以控制這種關乎不安全感的擔憂，甚至可以避免可能會驗證自己的無能感的可怕錯誤。通常強迫者對自身意象傾向保守，有時甚至是負向的，當此傾向是不切實際且誇張的，則當面臨挫敗時將有很高的風險產生心理問題，因為他們也傾向放大錯誤的重要性及後果，且早已準備好貶低自己。"],
["Finding2","HVI: Yes","(hypervigilant) 個體因對外界保持不信任態度而呈現有過度警戒，他們非常關注於維護自我正直 (integrity)，且傾向將困境或挫敗的成因歸咎於外力影響，無論現實情境如何。對他人行動或反應的不確定性，促使他們更關注於準備是否周全，以確保自身行為是適切的，並且得以避免被貶低或操弄。他們此種自我維護的狀態是非常缺乏彈性的，並且需投入大量心力以維持之，當環境造成警覺提升時，個體的意念中偏執特徵會變得更為明顯。"]]]];

var AllIntPer_Int =
[["Step1","Step2","Step3","Step4","Step5","Step6","Step7a","Step7b","Step8"],
[[["Finding","CDI = 4 or 5","個體較多數人於社交層面更顯不成熟，可能社交技巧有限，且與外界互動時會頻繁經驗到困難，尤其於人際情境時。與他人的關係很可能很表淺且難維繫，並且在別人眼中，當處理人際議題時，他們常被認為是疏遠、無能、無助的，亦較不敏銳於他人的需求及興趣。通常回顧近期史會有社交或人際的不滿足，有時會害羞而迴避社交互動，並採更孤獨的生活方式，僅包含很表淺的關係。然而他們對社交的渴求可能與大部分人相同，他們會尋求親密且持久的關係，但礙於其社交能力缺陷而難被他人接納，或容易被拒絕，這會造成其對生活不滿足，且經常對其社交處境感到混淆或無助，面對社交挫敗，他們也常會有一陣陣的憂鬱反應。<br>CDI 陽性常見於兒童，因為此時正投身於自我認同及與同儕關係的議題之中。但對青少年及成人而言，即反應其社交不成熟，且於與他人建立並維持關係上有些問題。"]],
[["Finding","HVI positive","在與他人的關係中，個體傾向過度謹慎與保守，容易感到非常脆弱，並且非常審慎於構思及施行行為，亦過於關注個人空間。他們通常沒有持久的親密關係，除非在關係的互動中能讓他們感到掌控感。他們並不期待親密關係出現，並且常對於親密他人的舉措起疑心。雖然這不必然是病態的，但誇大的警覺常造成偏執般的行為表現。"]],
[["Finding","p > a + 1","一般來說，個體傾向於人際關係中採取較為被動的角色 (不一定是屈從)，他們通常偏好迴避決策責任、較不會找出問題的新解法、亦不傾向採納新的行為模式，尤其當他人可能會負責承擔這些責任時。"]],
[["Finding","Fd > 0","個體比預期展現出更多的依賴行為，通常會依賴他人的指引及支持，且對人際關係的期待往往是相當天真的，經常預期他人對於自己的需求及要求會更為包容，也預期他人更願意依循其需求及要求行事。若此類人同時有被動的特徵，則被動依賴將會是其人格結構的重要核心組成。"]],
[["Finding1","SumT = 1","個體於承認並表達親密需求的層面與大多數人一致，通常願意建立親密關係，並且保持開放態度於透過日常親密肢體接觸以建立並維繫親密關係。"],
["Finding2","SumT = 0","個體於親密關係中顯得更為保守，尤其對於會有肢體接觸的關係，可能過度關注於個人空間，且更謹慎於與他人建立及維持親密關係。<br>但此發現有例外，當所有反應中都沒有黑白反應 (C') 也沒有陰影反應 (V, T, Y) 時，此時應小心是否納入此發現，可回顧近期史尋找證據支持是否納入此發現。"],
["Finding3","SumT > 0","個體對於親密關係有強烈的需求不滿足，這可能是被近期情緒失落所誘發的反應性渴望，但這也可能是一種持續的狀態，也可由過往情緒失落或從未被適切補償或取代的失望所引起。無論哪種，個體常會懷揣著令人激躁的渴求或孤獨感，經驗此種激躁狀態者，很想要與他人有親密的情感關係，但又苦於如何最好的實現此種關係。有時強烈的需求會干擾其判斷，且因此容易受人操弄，尤其是被動或依賴者。"]],
[["Finding1","Human Contents 介於預期範圍<br>& [pure H > (Human Contents)/2 for intro<br>or pure H ≥ (Human Contents)/2 for others]","個體對他人的興趣與大多數人相近，且對他人概念化的歷程是基於現實的。"],
["Finding2","Human Contents 介於預期範圍<br>& [pure H ≤ (Human Contents)/2 for intro<br>or pure H < (Human Contents)/2 for others]","個體對他人的興趣與大多數人相近，但很可能無法很正確的理解他人。容易誤讀他人，且頻繁誤解社交線索。有時對自身關係抱有超出合理範圍的期待，有時缺乏理解會導致社交失誤，進而造成與人疏遠的可能。"],
["Finding3","Human Contents 超過預期範圍<br>& [pure H > (Human Contents)/2 for intro<br>or pure H ≥ (Human Contents)/2 for others]","個體對他人有濃厚興趣，並且此興趣是基於對他人合乎於現實的理解。這通常是正向健康的發現，除非出現在高度警覺者 (HVI)，因為他們對他者有強烈的不信任感。"],
["Finding4","Human Contents 超過預期範圍<br>& [pure H ≤ (Human Contents)/2 for intro<br>or pure H < (Human Contents)/2 for others]","個體對他人有濃厚興趣，但同時很可能無法很正確的理解他人，對他人感興趣可以是正向健康，但當對他人有防衛或不信任時，也可能是不健康的。不論何者，對他人缺乏正確理解，都常會造成對關係不切實際的期待，亦導致社交失誤，進而有與人疏遠的可能。"],
["Finding5","Human Contents 低於預期範圍<br>& R < 17","個體不如大部分人般對他人感興趣，這經常可見於情緒疏離或社交孤立者。"],
["Finding5","Human Contents 低於預期範圍<br>& R ≥ 17<br>& [pure H > (Human Contents)/2 for intro<br>or pure H ≥ (Human Contents)/2 for others]","個體不如大部分人般對他人感興趣，這經常可見於情緒疏離或社交孤立者，但他們對他人的知覺與理解是合乎現實的。"],
["Finding5","Human Contents 低於預期範圍<br>& R ≥ 17<br>& [pure H ≤ (Human Contents)/2 for intro<br>or pure H < (Human Contents)/2 for others]","個體不如大部分人般對他人感興趣，這經常可見於情緒疏離或社交孤立者，並且他們很可能無法很正確的理解他人。"]],
[["Finding1","GHR + PHR ≥ 3<br>& GHR > PHR","個體的人際行為是適切於所屬情境的，當 GHR 多出越多，表示其人際行為有效於在更廣泛的人際關係中，且通常是受人贊同的。"],
["Finding2","GHR + PHR ≥ 3<br>& GHR ≤ PHR","個體的人際行為較不適切於所屬情境，當 PHR 多出越多，表示其人際行為無效於更多情境中，且通常是不受他人贊同的。"]],
[["Finding1","COP = 0<br>& AG = 0 or 1","個體平常不預期有正向的人際互動，傾向於人際情境中感到不舒服，容易被他人認為是疏離或淡漠的。雖然不排除成熟或有深交，但一般而言，他們不被認為是團體生活的，且常在團體互動中保持邊緣。"],
["Finding2","(COP = 0 or 1<br>& AG ≥ 2)<br>or (COP = 2<br>& AG > 2)","個體傾向將攻擊性知覺為人際關係的自然組成，通常其日常行為是強硬或具攻擊性的。有時這反映出對人際情境不安全感的一種防衛手段，但更常是反映一種習得的人際互動方式。其武斷或攻擊性的展現，很大程度會依其他人格特質及情境本質而有所差異。"],
["Finding3","COP = 1 or 2<br>& AG = 0 or 1","個體通常期待正向人際互動，並感興趣於參與其中，而具體的互動模式會由其其他個人特徵決定，尤其因應風格及自我意象。"],
["Finding4","COP = 2 or 3<br>& AG = 2","個體對正向人際互動保持開放及感興趣，但同時許多互動會顯得強硬或有攻擊性。"],
["Finding5","(COP ≥ 3<br>& AG = 0 or 1)<br>or (COP > 3<br>& AG ≤ 2)","個體通常是討喜且外向的，他們通常把人際活動視為其日常中相當重要的一環，會期待並尋找與他人和諧的人際互動，且被周遭人視為是更群體性的。"],
["Finding6","COP ≥ 3<br>& AG > 2","顯示有嚴重衝突或混淆於人際行為模式的適切性，他們通常不太了解他人，且於日常人際互動中行為較不一致或是難預測的。"]],
[["Finding1","PER = 2 or 3","個體較大多數人對於人際情境更顯防衛，於此些情境中，會仰賴資訊呈現以維護安全感。這不必然損壞人際關係，僅顯示其可能於此些具挑戰的情境更顯不安全。"],
["Finding2","PER > 3","個體於人際情境中無法確知其完整性 (integrity)，並於此些情境中傾向變得防衛專制，以作為對自我受人際情境中引發的挑戰的抵抗方式。此類人通常會被認為是固執或心智狹隘的。因此，他們通常困難於維繫親密關係，尤其對於不屈從於他們的人。"]],
[["Finding1","0.26 ≤ Iso Index ≤ 0.32","個體於社交互動中傾向較不主動，這不表示其有社交不適應或社交衝突，而是對日常社交互動較不感興趣或較不願意投入其中，若此為真，通常 Human Content 數量會至少在平均或以上，且 COP ≥ 1，顯示其對人際感興趣，但參與有限。"],
["Finding2","Iso Index ≥ 0.33","個體更顯得人際孤立，通常 Human Content 量少於平均，且 COP 很少超過 1。他們困難於建立並維繫平穩或有意義的人際關係，這並不表示病態的社交疏離，而僅表示可能有某種原因造成其無法與他人良好聯繫，且常發現自己無效於人際酬賞。"]]]];



function Reload(){
	document.location.reload();
}


function HRjudgefun(RespTin){
	var RespT = [];
	for(let i=0; i<RespTin.length; i++) RespT.push(RespTin[i]);
	var HRjudge = false;
	var AllHCont = ["H","(H)","Hd","(Hd)","Hx"];
	var AllM = ["Ma","Mp","Map"];

	// HR is true
	if(RespT[8].includes(",")) {
		RespT[8] = RespT[8].split(",");
		for(let i=0; i<5; i++) if(RespT[8].includes(AllHCont[i])) HRjudge = true;
	}else{
		if(AllHCont.includes(RespT[8])) HRjudge = true;
	}

	if(RespT[5].includes("FM")){
		if(RespT[11].includes("COP") | RespT[11].includes("AG")) HRjudge = true;
	}

	if(RespT[5].includes(".")){
		RespT[5] = RespT[5].split(".");
		for(let i=0;i <3; i++) if(RespT[5].includes(AllM[i])) HRjudge = true;
	}else{
		if(AllM.includes(RespT[5])) HRjudge = true;
	}


	if(HRjudge){
		// Step1
		if((RespT[8] == "H") | (Array.isArray(RespT[8]) & RespT[8].includes("H"))){
			if(["+","o","u"].includes(RespT[6]) & !RespTin[11].includes("INC") & !RespTin[11].includes("DR") & !RespTin[11].includes("FAB") & !RespTin[11].includes("ALOG") & !RespTin[11].includes("CON") & !RespTin[11].includes("AG") & !RespTin[11].includes("MOR")) return "GHR";
		}

		// Step2
		if(["+","o","u"].includes(RespT[6])){
			if(RespTin[11].includes("ALOG") | RespTin[11].includes("CON") | RespTin[11].includes("2")) return "PHR";
		}else{return "PHR";}

		// Step3
		if(RespTin[11].includes("COP") & !RespTin[11].includes("AG")) return "GHR";

		// Step4
		if(RespTin[11].includes("FAB") | RespTin[11].includes("MOR") | RespTin[8].includes("An")) return "PHR";

		// Step5
		if(RespT[9] == "P" & ["Card III","Card IV","Card VII","Card IX"].includes(RespT[0])) return "GHR";

		// Step6
		if(RespTin[11].includes("AG") | RespTin[11].includes("INC") | RespTin[11].includes("DR")) return "PHR";
		if(typeof(RespT[8]) == "string"){
			if(RespT[8] == "Hd") return "PHR";
		}else{
			if(RespT[8].includes("Hd")) return "PHR";
		}

		return "GHR";
	}else{return "";}
}





function addResp(){ 
	var AResp = document.getElementsByName("Resp");
	var myTable = document.getElementById("RespTable");
	var DoAdd = true;
	for(let i=0; i<12; i++){
		if(AResp[i].value == "" | AResp[i].value == "選擇" | AResp[i].value == null){
			alert("請輸入 " + RespNames[i]);
			DoAdd = false;
			break;
		}
	}

	if(DoAdd){
		AllIndex.push(Number(AResp[1].value));
		AllIndex.sort(function(a,b){if(a>b) return 1;if(a<b) return -1; return 0;});
		var addRow = myTable.insertRow(AllIndex.indexOf(Number(AResp[1].value)));
		var RespText = [];

		for(let i=0; i<AResp.length; i++) {
			addRow.insertCell(i).innerHTML = AResp[i].value;
			RespText.push(AResp[i].value);
		}
		if(AResp[10].value != " " & AResp[10].value.includes("Z")) addRow.cells[10].innerHTML = ZScore_Tran[CardDict.indexOf(AResp[0].value)][ZDict.indexOf(AResp[10].value)];
		addRow.id = "myID" + idCount//new Date().getTime();
		addRow.insertCell(12).innerHTML='<input type=\'button\'  value=\'删除\' onclick=\'delrow("'+("myID" + idCount)+'")\'>';

		var CardColor = ["Card I", "Card III", "Card V", "Card VII", "Card IX"];
		if(CardColor.includes(AResp[0].value)) addRow.style = "background-color:#E0E0E0;";

		AResp[1].value = Number(AResp[1].value) + 1;
		idCount += 1;

		if(HRjudgefun(RespText) != "") {
			if(addRow.cells[11].innerHTML.length > 1) {
				addRow.cells[11].innerHTML += "," + HRjudgefun(RespText);
			}else{
				addRow.cells[11].innerHTML = HRjudgefun(RespText);
			}
		}

//		document.getElementById("hihi").innerHTML += HRjudgefun(RespText) + "..."+HRjudgefun(RespText) +"<br>";
	}
}

function delrow(trId){
	var ok = window.confirm("真的刪掉嗎><");
	var myTable = document.getElementById("RespTable");
	if(ok){
		delIndex = document.getElementById(trId).rowIndex;
		AllIndex.splice(delIndex,1);
		myTable.deleteRow(delIndex);
	}
}







function openSSDia(){
	var Dial = document.getElementById("SSDia");
	Dial.showModal();
	var SSBtns = document.getElementsByName("SSBtn");
	for(let i=0; i<SSBtns.length; i++) SSBtns[i].disabled = false;
}

function showBtnName_SS(BtnName){
	var SSNow_Dia = document.getElementById("mySS_Dia");
	document.getElementById(BtnName+"Btn").disabled = true;
	document.getElementById("noneBtn").disabled = true;

	if(SSNow_Dia.innerHTML == ""){
		SSNow_Dia.innerHTML = BtnName;
	}else{
		SSNow_Dia.innerHTML = SSNow_Dia.innerHTML + "," + BtnName;
	}

	// Lv1 Lv2
	if(BtnName.includes("DV")){
		document.getElementById("DV1Btn").disabled = true;
		document.getElementById("DV2Btn").disabled = true;
	}

	if(BtnName.includes("INC")){
		document.getElementById("INC1Btn").disabled = true;
		document.getElementById("INC2Btn").disabled = true;
	}

	if(BtnName.includes("DR")){
		document.getElementById("DR1Btn").disabled = true;
		document.getElementById("DR2Btn").disabled = true;
	}

	if(BtnName.includes("FAB")){
		document.getElementById("FAB1Btn").disabled = true;
		document.getElementById("FAB2Btn").disabled = true;
	}

}

function SSNone(){
	var SSNow_Dia = document.getElementById("mySS_Dia");
	document.getElementById("RespSS").value = " ";
	SSNow_Dia.innerHTML = "";

	var Dial = document.getElementById("SSDia");
	Dial.close();
}

function SSDiaConf(){
	var SSNow_Dia = document.getElementById("mySS_Dia");
	document.getElementById("RespSS").value = SSNow_Dia.innerHTML;
	SSNow_Dia.innerHTML = "";

	var Dial = document.getElementById("SSDia");
	Dial.close();
}

function SSDiaRest(){
	document.getElementById("mySS_Dia").innerHTML = "";
	var SSBtns = document.getElementsByName("SSBtn");
	for(let i=0; i<SSBtns.length; i++) SSBtns[i].disabled = false;
}





function openConDia(){
	var Dial = document.getElementById("ConDia");
	Dial.showModal();
	var ConBtns = document.getElementsByName("ConBtn");
	for(let i=0; i<ConBtns.length; i++) ConBtns[i].disabled = false;
}

function showBtnName_Con(BtnName){
	var ConNow_Dia = document.getElementById("myCon_Dia");
	document.getElementById(BtnName+"Btn").disabled = true;
	if(ConNow_Dia.innerHTML == ""){
		ConNow_Dia.innerHTML = BtnName;
	}else{
		ConNow_Dia.innerHTML = ConNow_Dia.innerHTML + "," + BtnName;
	}

	// Bt, Ls, Na
	if(["Bt","Ls","Na"].includes(BtnName)){
		document.getElementById("BtBtn").disabled = true;
		document.getElementById("LsBtn").disabled = true;
		document.getElementById("NaBtn").disabled = true;
	}
}

function ConDiaConf(){
	var ConNow_Dia = document.getElementById("myCon_Dia");
	document.getElementById("RespCon").value = ConNow_Dia.innerHTML;
	ConNow_Dia.innerHTML = "";

	var Dial = document.getElementById("ConDia");
	Dial.close();
}

function ConDiaRest(){
	document.getElementById("myCon_Dia").innerHTML = "";
	var ConBtns = document.getElementsByName("ConBtn");
	for(let i=0; i<ConBtns.length; i++) ConBtns[i].disabled = false;
}






function openDetDia(){
	var Dial = document.getElementById("DetDia");
	Dial.showModal();
	var DetBtns = document.getElementsByName("DetBtn");
	for(let i=0; i<DetBtns.length; i++) DetBtns[i].disabled = false;
}

function showBtnName_Det(BtnName){
	var DetNow_Dia = document.getElementById("myDet_Dia");
	document.getElementById(BtnName+"Btn").disabled = true;

	if(DetNow_Dia.innerHTML == ""){
		DetNow_Dia.innerHTML = BtnName;
	}else{
		DetNow_Dia.innerHTML = DetNow_Dia.innerHTML + "." + BtnName;
	}

	// Movement
	if(["Ma","Mp","Map"].includes(BtnName)){
		document.getElementById("MaBtn").disabled = true;
		document.getElementById("MpBtn").disabled = true;
		document.getElementById("MapBtn").disabled = true;
	}
	if(["FMa","FMp","FMap"].includes(BtnName)){
		document.getElementById("FMaBtn").disabled = true;
		document.getElementById("FMpBtn").disabled = true;
		document.getElementById("FMapBtn").disabled = true;
	}
	if(["ma","mp","map"].includes(BtnName)){
		document.getElementById("maBtn").disabled = true;
		document.getElementById("mpBtn").disabled = true;
		document.getElementById("mapBtn").disabled = true;
	}

	// Chromatic
	if(["FC","CF","C"].includes(BtnName)){
		document.getElementById("FCBtn").disabled = true;
		document.getElementById("CFBtn").disabled = true;
		document.getElementById("CBtn").disabled = true;
	}

	// Achromatic
	if(["FC'","C'F","C'"].includes(BtnName)){
		document.getElementById("FC'Btn").disabled = true;
		document.getElementById("C'FBtn").disabled = true;
		document.getElementById("C'Btn").disabled = true;
	}

	// Shading
	if(["FT","TF","T"].includes(BtnName)){
		document.getElementById("FTBtn").disabled = true;
		document.getElementById("TFBtn").disabled = true;
		document.getElementById("TBtn").disabled = true;
	}
	if(["FV","VF","V"].includes(BtnName)){
		document.getElementById("FVBtn").disabled = true;
		document.getElementById("VFBtn").disabled = true;
		document.getElementById("VBtn").disabled = true;
	}
	if(["FY","YF","Y"].includes(BtnName)){
		document.getElementById("FYBtn").disabled = true;
		document.getElementById("YFBtn").disabled = true;
		document.getElementById("YBtn").disabled = true;
	}
	if(["Fr","rF"].includes(BtnName)){
		document.getElementById("FrBtn").disabled = true;
		document.getElementById("rFBtn").disabled = true;
	}
}

function DetDiaConf(){
	var DetNow_Dia = document.getElementById("myDet_Dia");
	document.getElementById("RespDet").value = DetNow_Dia.innerHTML;
	DetNow_Dia.innerHTML = "";

	var Dial = document.getElementById("DetDia");
	Dial.close();
}

function DetDiaRest(){
	document.getElementById("myDet_Dia").innerHTML = "";
	var DetBtns = document.getElementsByName("DetBtn");
	for(let i=0; i<DetBtns.length; i++) DetBtns[i].disabled = false;
}


function StrSum_Show_fun(){
	var showStatus = document.getElementById("StrSum_Show_Name")
	var showTable = document.getElementById("StrSum_Show")
	if(showStatus.innerHTML == "隱藏 Structural Summary"){
		showTable.style.display = "none";
		showStatus.innerHTML = "顯示 Structural Summary";
	}else{
		showTable.style.display = "block";
		showStatus.innerHTML = "隱藏 Structural Summary";
	}
}

function CoreSec_Show_fun(){
	var showStatus = document.getElementById("CoreSec_Show_Name")
	var showTable = document.getElementById("CoreSec_Show")
	if(showStatus.innerHTML == "隱藏 Core Section &amp; Special Indices"){
		showTable.style.display = "none";
		showStatus.innerHTML = "顯示 Core Section & Special Indices";
	}else{
		showTable.style.display = "block";
		showStatus.innerHTML = "隱藏 Core Section & Special Indices";
	}
}




function Summary1(){
	if(!confirm("請再次確認 Coding\n一旦 \"GOGO\" 就不能再改\nShin 秘書的資工能力不支援事後修改")) return null;

	var myTable = document.getElementById("RespTable");
	var myResp = [[],[],[],[],[],[],[],[],[],[],[],[]];
	var aTempResp = "";
	var myRespForText = [];
	var myR = myTable.rows.length - 5;

	if(myTable.rows.length < 19){
		alert("反應量不足 (只有 " +(myTable.rows.length-5)+ " 個 < 14 個)，無法進行有效分析哦，呵呵：）");
		return null;
	}

	document.getElementById("GOGOBtn").disabled = "disabled"; // disable Btn
	document.getElementById("GOGOBtn").style['background-color'] = '#FFF';
	document.getElementById("GOGOBtn").style['color'] = '#BEBEBE';
	
	for(let j=1; j<(myR+1); j++){
		aTempResp = "";
		for(let i=0; i<12; i++) {
			myResp[i].push(myTable.rows[j].cells[i].innerHTML);
			if(i == 1 | i == 4) continue;
			if(i == 2 | i == 5) {
				aTempResp += myTable.rows[j].cells[i].innerHTML;
			}else{
				aTempResp += myTable.rows[j].cells[i].innerHTML + " ";
			}
		}
		myRespForText.push(aTempResp);
	}
	
	// all calculator
	var count = 0;
	var myLoc = [0,0,0,0,0,0,0];
	var myLoc_StrSum = [0,0,0,0,0];
	var myS_Loc = [false,false];
	var myLoc_byCard = [[],[],[],[],[],[],[],[],[],[]];
	var myDQ = [0,0,0,0];
	var myDQ_byCard = [[],[],[],[],[],[],[],[],[],[]];
	var myFQ = [[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0]];
	var myMinus = [[],[],[]];
	var myDet = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
	var myDet_All = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
	var myBle = [];
	var myPair = 0;
	var myCon = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
	var myHum = [];
	var mySS = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
	var mySum6 = [0,0];
	var myZ = [0,0,0];
	var myP = 0;
	var mySmin = 0;
	var myIntPer_S11 = [];
	var ParResp = [];

	for(let i=0; i<myR; i++){
		ParResp.push(myResp[0][i]+";"+myResp[1][i]+";"+myResp[2][i]+myResp[3][i]+";"+myResp[4][i]+";"+myResp[5][i]+myResp[6][i]+";"+myResp[7][i]+";"+myResp[8][i]+";"+myResp[9][i]+";"+myResp[10][i]+";"+myResp[11][i]);

		myLoc[LocDict.indexOf(myResp[2][i])] += 1;
		myLoc_byCard[CardDict.indexOf(myResp[0][i])].push(myResp[2][i]);
		myDQ[DQDict.indexOf(myResp[3][i])] += 1;
		myDQ_byCard[CardDict.indexOf(myResp[0][i])].push(myResp[3][i]);
		myFQ[0][FQDict.indexOf(myResp[6][i])] += 1;
		if(myResp[2][i].includes("S") & myResp[6][i] == "-") mySmin += 1;
		if(myResp[2][i].includes("S") & myResp[0][i] != "Card I" & myResp[0][i] != "Card II") myS_Loc[0] = true;
		if(myResp[2][i].includes("S") & myResp[0][i] != "Card I" & myResp[0][i] != "Card II" & myResp[0][i] != "Card III") myS_Loc[1] = true;

		if(myResp[6][i] == "-"){
			myMinus[0].push(myResp[0][i]);
			myMinus[1].push(myResp[5][i]);
			myMinus[2].push(myResp[8][i]);
		}

		if(myResp[5][i].includes("M") & myResp[7][i] == "(2)") myIntPer_S11.push(i);

		if(myResp[5][i].includes(".")){
			myBle.push(myResp[5][i]);
			myResp[5][i] = myResp[5][i].split(".");
			for(let j=0; j<myResp[5][i].length; j++) myDet_All[AllDetDict.indexOf(myResp[5][i][j])] += 1;
		}else{
			myDet[AllDetDict.indexOf(myResp[5][i])] += 1;
			myDet_All[AllDetDict.indexOf(myResp[5][i])] += 1;
		}
		
		if(["W","WS","D","DS"].includes(myResp[2][i])) myFQ[2][FQDict.indexOf(myResp[6][i])] += 1;
		if(typeof(myResp[5][i]) == "string"){
			if(["Ma","Mp","Map"].includes(myResp[5][i])) myFQ[1][FQDict.indexOf(myResp[6][i])] += 1;
		}else{
			if(myResp[5][i].includes("Ma") | myResp[5][i].includes("Mp") | myResp[5][i].includes("Map")) myFQ[1][FQDict.indexOf(myResp[6][i])] += 1;
		}

		if(myResp[7][i] == "(2)") myPair += 1;

		if(myResp[8][i].includes(",")){
			myResp[8][i] = myResp[8][i].split(",");
			for(let j=0; j<myResp[8][i].length; j++) {
				myCon[AllConDict.indexOf(myResp[8][i][j])] += 1;
				if(myResp[8][i][j] == "H" | myResp[8][i][j] == "Hd" | myResp[8][i][j] == "(H)" | myResp[8][i][j] == "(Hd)") myHum.push(i);
			}
		}else{
			myCon[AllConDict.indexOf(myResp[8][i])] += 1;
			if(myResp[8][i] == "H" | myResp[8][i] == "Hd" | myResp[8][i] == "(H)" | myResp[8][i] == "(Hd)") myHum.push(i);
		}

		if(myResp[9][i] == "P") myP += 1;

		if(myResp[10][i] != " "){
			myZ[0] += 1;
			myZ[1] += Number(myResp[10][i]);
		}

		if(myResp[11][i].includes(",")){
			myResp[11][i] = myResp[11][i].split(",");
			for(let j=0; j<myResp[11][i].length; j++) mySS[AllSSDict.indexOf(myResp[11][i][j])] += 1;
		}else{
			mySS[AllSSDict.indexOf(myResp[11][i])] += 1;
		}
	}




	// for parent to child
	document.getElementById("ParentBlends").innerHTML = myBle;
	document.getElementById("ParentResp").innerHTML = ParResp.join("--");

	// for StrSum_Z
	var StrSum_ZText = document.getElementsByName("StrSum_Z");
	myZ[2] = ZestDict[myZ[0]];
	for(let i=0; i<3; i++) StrSum_ZText[i].innerHTML = myZ[i];

	// for StrSum_Loc
	myLoc_StrSum[0] = myLoc[0] + myLoc[4];
	myLoc_StrSum[1] = myLoc[1] + myLoc[5];
	myLoc_StrSum[2] = myLoc[0] + myLoc[4] + myLoc[1] + myLoc[5];
	myLoc_StrSum[3] = myLoc[2] + myLoc[6];
	myLoc_StrSum[4] = myLoc[3] + myLoc[4] + myLoc[5] + myLoc[6];
	var StrSum_LocText = document.getElementsByName("StrSum_Loc");
	for(let i=0; i<5; i++) StrSum_LocText[i].innerHTML = myLoc_StrSum[i];

	// for DQ
	var StrSum_DQText = document.getElementsByName("StrSum_DQ");
	for(let i=0; i<4; i++) StrSum_DQText[i].innerHTML = myDQ[i];

	// for Determinants
	myDet = myDet.concat([myDet[0]+myDet[1]+myDet[2], myDet[3]+myDet[4]+myDet[5], myDet[6]+myDet[7]+myDet[8]]);
	myDet_All = myDet_All.concat([myDet_All[0]+myDet_All[1]+myDet_All[2], myDet_All[3]+myDet_All[4]+myDet_All[5], myDet_All[6]+myDet_All[7]+myDet_All[8]]);
	var StrSum_DetText = document.getElementsByName("StrSum_Det");
	if(myDet_All[29] != 0) StrSum_DetText[0].innerHTML = myDet_All[29];
	if(myDet_All[30] != 0) StrSum_DetText[1].innerHTML = myDet_All[30];
	if(myDet_All[31] != 0) StrSum_DetText[2].innerHTML = myDet_All[31];
	for(let i=3; i<23; i++) if(myDet_All[i+6] != 0) StrSum_DetText[i].innerHTML = myDet_All[i+6];
	var myM = myDet_All[29];
	var myFM = myDet_All[30];
	var mym = myDet_All[31];
	var myRefl = myDet_All[25]+myDet_All[26];
	var myFD = myDet_All[27];

	var BleTable = document.getElementById("BleTable");
	BleTable.deleteRow(0);
	var addBleRow = BleTable.insertRow(0);
	var DetBleCell = addBleRow.insertCell(0);
	addBleRow.id = "DetBle";
	DetBleCell.innerHTML='<td>Determinants - Blends</td>';
	DetBleCell.style = "background-color:#F0F0F0;";



	var StrSum_BleText = document.getElementById("DetBle");
	for(let i=1; i<StrSum_BleText.cells.length; i++) StrSum_BleText.deleteCell(1);
	for(let i=0; i<myBle.length; i++) StrSum_BleText.insertCell(i+1).innerHTML = myBle[i];

	// for (2)
	if(myPair != 0) StrSum_DetText[23].innerHTML = myPair;

	// for FQ
	var StrSum_FQText = document.getElementsByName("StrSum_FQ");
	for(let i=0; i<5; i++) StrSum_FQText[i].innerHTML = myFQ[0][i];
	for(let i=5; i<10; i++) StrSum_FQText[i].innerHTML = myFQ[1][i-5];
	for(let i=10; i<15; i++) StrSum_FQText[i].innerHTML = myFQ[2][i-10];

	// for Contents
	var StrSum_ConText = document.getElementsByName("StrSum_Con");
	for(let i=0; i<27; i++) if(myCon[i] != 0) StrSum_ConText[i].innerHTML = myCon[i];
	var myFd = myCon[16];

	// for Special Score
	var StrSum_SSText = document.getElementsByName("StrSum_SS");
	for(let i=0; i<19; i++) if(mySS[i] != 0) StrSum_SSText[i].innerHTML = mySS[i];
	var myAB = mySS[10];
	var myAG = mySS[11];
	var myCOP = mySS[12];
	var myCP = mySS[13];
	var myGHR = mySS[14];
	var myPHR = mySS[15];
	var myMOR = mySS[16];
	var myPER = mySS[17];
	var myPSV = mySS[18];

	var StrSum_Sum6Text = document.getElementsByName("StrSum_Sum6");
	var Sum6Wei = [1,2,2,4,3,6,4,7,5,7];
	for(let i=0; i<10; i++){
		mySum6[0] += mySS[i];
		mySum6[1] += mySS[i]*Sum6Wei[i];
	}
	StrSum_Sum6Text[0].innerHTML = mySum6[0];
	StrSum_Sum6Text[1].innerHTML = mySum6[1];



	// Ratios, Percentages, and Derivations
	// Core Section
	var RPD_1Text = document.getElementsByName("RPD_1");
	var myL = (myDet[28]/(myR - myDet[28])).toFixed(2);
	var WSumC = myDet_All[9]*0.5 + myDet_All[10] + myDet_All[11]*1.5;
	var EB = [myM,WSumC];
	var EA = EB[0] + EB[1];
	if(EA >= 4 & myL < 1){
		if(EA <= 10 & Math.abs(EB[0]-EB[1]) >= 2){
			if(EB[0] > EB[1]) var EBPer = (EB[0]/EB[1]).toFixed(2);
		}else if(EA > 10 & Math.abs(EB[0]-EB[1]) >= 2.5){
			if(EB[0] > EB[1]) var EBPer = (EB[0]/EB[1]).toFixed(2);
		}
	}
	var SumCpr = myDet_All[13] + myDet_All[14] + myDet_All[15];
	var SumT = myDet_All[16] + myDet_All[17] + myDet_All[18];
	var SumV = myDet_All[19] + myDet_All[20] + myDet_All[21];
	var SumY = myDet_All[22] + myDet_All[23] + myDet_All[24];
	var eb = [myFM+mym, SumCpr + SumT + SumV + SumY];
	var es = eb[0] + eb[1];
	var DScore_table = [-13,-10.5,-8,-5.5,-3,2.5,5,7.5,10,12.5,50];
	for(let i=0; i<11; i++){
		if(EA - es <= DScore_table[i]){
			var DScore = i-5;
			break;
		}
	}
	var Adjes = es;
	if(mym>1) Adjes -= (mym-1);
	if(SumY>1) Adjes -= (SumY-1);
	for(let i=0; i<11; i++){
		if(EA - Adjes <= DScore_table[i]){
			var AdjD = i-5;
			break;
		}
	}

	RPD_1Text[0].innerHTML = myR;
	RPD_1Text[1].innerHTML = myL;
	RPD_1Text[2].innerHTML = EB[0]+":"+EB[1];
	RPD_1Text[3].innerHTML = EA;
	if(EBPer){
		RPD_1Text[4].innerHTML = EBPer
	}else{
		RPD_1Text[4].innerHTML = "NA";
	}
	RPD_1Text[5].innerHTML = eb[0]+":"+eb[1];
	RPD_1Text[6].innerHTML = es;
	RPD_1Text[7].innerHTML = DScore;
	RPD_1Text[8].innerHTML = Adjes;
	RPD_1Text[9].innerHTML = AdjD;
	RPD_1Text[10].innerHTML = myFM;
	RPD_1Text[11].innerHTML = SumCpr;
	RPD_1Text[12].innerHTML = SumT;
	RPD_1Text[13].innerHTML = mym;
	RPD_1Text[14].innerHTML = SumV;
	RPD_1Text[15].innerHTML = SumY;

	// Ideation Section
	var RPD_2Text = document.getElementsByName("RPD_2");
	var a_p = [myDet_All[0]+myDet_All[2]+myDet_All[3]+myDet_All[5]+myDet_All[6]+myDet_All[8],myDet_All[1]+myDet_All[2]+myDet_All[4]+myDet_All[5]+myDet_All[7]+myDet_All[8]];
	var Ma_Mp = [myDet_All[0]+myDet_All[2],myDet_All[1]+myDet_All[2]];
	var Intell = 2*myAB+myCon[10]+myCon[11];
	var Lvl2 = mySS[1] + mySS[3] + mySS[5] + mySS[7];

	RPD_2Text[0].innerHTML = a_p[0]+":"+a_p[1];
	RPD_2Text[1].innerHTML = Ma_Mp[0]+":"+Ma_Mp[1];
	RPD_2Text[2].innerHTML = Intell;
	RPD_2Text[3].innerHTML = myMOR;
	RPD_2Text[4].innerHTML = mySum6[0];
	RPD_2Text[5].innerHTML = Lvl2;
	RPD_2Text[6].innerHTML = mySum6[1];
	RPD_2Text[7].innerHTML = myFQ[1][3];
	RPD_2Text[8].innerHTML = myFQ[1][4];

	// Affect Section
	var RPD_3Text = document.getElementsByName("RPD_3");
	var FC_ratio = [myDet_All[9],myDet_All[10]+myDet_All[11]];
	var Cons_ratio = [myDet_All[13]+myDet_All[14]+myDet_All[15],WSumC];
	var Afr = ((myR-myResp[0].indexOf("Card VIII"))/myResp[0].indexOf("Card VIII")).toFixed(2);
	var Comp_ratio = [myBle.length,myR];
	var Ble_R_port = myBle.length/myR;
	var PureC = myDet_All[11];
	var myS = myLoc_StrSum[4];

	RPD_3Text[0].innerHTML = FC_ratio[0]+":"+FC_ratio[1];
	RPD_3Text[1].innerHTML = PureC;
	RPD_3Text[2].innerHTML = Cons_ratio[0]+":"+Cons_ratio[1];
	RPD_3Text[3].innerHTML = Afr;
	RPD_3Text[4].innerHTML = myS;
	RPD_3Text[5].innerHTML = Comp_ratio[0]+":"+Comp_ratio[1];
	RPD_3Text[6].innerHTML = myCP;


	// Mediation Section
	var RPD_4Text = document.getElementsByName("RPD_4");
	var XAper = ((myFQ[0][0]+myFQ[0][1]+myFQ[0][2])/myR).toFixed(2);
	var WDAper = ((myFQ[2][0]+myFQ[2][1]+myFQ[2][2])/(myFQ[2][0]+myFQ[2][1]+myFQ[2][2]+myFQ[2][3]+myFQ[2][4])).toFixed(2);
	var Xminper = (myFQ[0][3]/myR).toFixed(2);
	var Xpluper = ((myFQ[0][0]+myFQ[0][1])/myR).toFixed(2);
	var Xuper = (myFQ[0][2]/myR).toFixed(2);

	RPD_4Text[0].innerHTML = XAper;
	RPD_4Text[1].innerHTML = WDAper;
	RPD_4Text[2].innerHTML = Xminper;
	RPD_4Text[3].innerHTML = mySmin;
	RPD_4Text[4].innerHTML = myP;
	RPD_4Text[5].innerHTML = Xpluper;
	RPD_4Text[6].innerHTML = Xuper;

	// Processing Section
	var RPD_5Text = document.getElementsByName("RPD_5");
	var W_D_Dd = [myLoc_StrSum[0], myLoc_StrSum[1], +myLoc_StrSum[3]];
	var myZd = myZ[1] - myZ[2];

	RPD_5Text[0].innerHTML = myZ[0];
	RPD_5Text[1].innerHTML = W_D_Dd.join(":");
	RPD_5Text[2].innerHTML = myLoc_StrSum[0]+":"+myM;
	RPD_5Text[3].innerHTML = myZd;
	RPD_5Text[4].innerHTML = myPSV;
	RPD_5Text[5].innerHTML = myDQ[0];
	RPD_5Text[6].innerHTML = myDQ[3];

	// Interpersonal Section
	var RPD_6Text = document.getElementsByName("RPD_6");
	var HumCon = myCon[0] + myCon[1] + myCon[2] + myCon[3];
	var IsoInd = ((2*(myCon[19]+myCon[26])+myCon[17]+myCon[24]+myCon[25])/myR).toFixed(2);

	RPD_6Text[0].innerHTML = myCOP;
	RPD_6Text[1].innerHTML = myAG;
	RPD_6Text[2].innerHTML = myGHR+":"+myPHR;
	RPD_6Text[3].innerHTML = a_p[0]+":"+a_p[1];
	RPD_6Text[4].innerHTML = myFd;
	RPD_6Text[5].innerHTML = SumT;
	RPD_6Text[6].innerHTML = HumCon;
	RPD_6Text[7].innerHTML = myCon[0];
	RPD_6Text[8].innerHTML = myPER;
	RPD_6Text[9].innerHTML = IsoInd;

	// Self Perception Section
	var RPD_7Text = document.getElementsByName("RPD_7");
	var EgoInd = ((3*myRefl+myPair)/myR).toFixed(2);
	var myH = myCon[0];
	var myOthH = HumCon-myCon[0];

	RPD_7Text[0].innerHTML = EgoInd;
	RPD_7Text[1].innerHTML = myRefl;
	RPD_7Text[2].innerHTML = SumV;
	RPD_7Text[3].innerHTML = myFD;
	RPD_7Text[4].innerHTML = myCon[9] + myCon[22];
	RPD_7Text[5].innerHTML = myMOR;
	RPD_7Text[6].innerHTML = myCon[0]+":"+(HumCon-myCon[0]);

	// Special Indices
	var RPD_8Text = document.getElementsByName("RPD_8");
	var SpeInd = [0,0,0,0];
	var ColShaBle = [0,0,0];
	var m_YBle = [0,0,0];
	var ShaBle = 0;
	// S-CON
	if((SumV+myFD)>2) SpeInd[3] += 1;
	var myBleSplit = [];
	for(let i=0; i<myBle.length; i++) myBleSplit.push(myBle[i].split("."));
	for(let i=0; i<myBle.length; i++){
		if(myBleSplit[i].includes("C") | myBleSplit[i].includes("CF") | myBleSplit[i].includes("FC")){
			if(myBle[i].includes("T") | myBle[i].includes("V") | myBle[i].includes("Y") | myBle[i].includes("C'")){
				ColShaBle[0] +=1;
			}
			if(myBle[i].includes("T") | myBle[i].includes("V") | myBle[i].includes("C'")){
				ColShaBle[1] +=1;
			}
			if(myBle[i].includes("Y")) ColShaBle[2] += 1;
		}
		if(myBleSplit[i].includes("ma") | myBleSplit[i].includes("mp") | myBleSplit[i].includes("map")) m_YBle[0] += 1;
		if(myBle[i].includes("Y")) m_YBle[1] += 1;
		if(myBleSplit[i].includes("ma") | myBleSplit[i].includes("mp") | myBleSplit[i].includes("map") | myBle[i].includes("Y")) m_YBle[2] += 1;
		if((myBle[i].includes("T") & myBle[i].includes("V")) | (myBle[i].includes("T") & myBle[i].includes("Y")) | (myBle[i].includes("T") & myBle[i].includes("C'")) | (myBle[i].includes("V") & myBle[i].includes("Y")) | (myBle[i].includes("V") & myBle[i].includes("C'")) | (myBle[i].includes("Y") & myBle[i].includes("C'"))) ShaBle += 1;
	}
	if(ColShaBle[0] > 0) SpeInd[3] += 1;
	if(EgoInd < 0.31 | EgoInd > 0.44) SpeInd[3] += 1;
	if(myMOR > 3) SpeInd[3] += 1;
	if((myZ[1] - myZ[2]) > 3.5 | (myZ[1] - myZ[2]) < -3.5) SpeInd[3] += 1;
	if(es > EA) SpeInd[3] += 1;
	if(myDet_All[10] + myDet_All[11] > myDet_All[9]) SpeInd[3] += 1;
	if(Xpluper < 0.7) SpeInd[3] += 1;
	if(myS > 3) SpeInd[3] += 1;
	if(myP < 3 | myP > 8) SpeInd[3] += 1;
	if(myCon[0] < 2) SpeInd[3] += 1;
	if(myR < 17) SpeInd[3] += 1;
	// PTI
	if(XAper < 0.7 & WDAper < 0.75) SpeInd[0] += 1;
	if(Xminper > 0.29) SpeInd[0] += 1;
	if(Lvl2 > 2 & mySS[7] > 0) SpeInd[0] += 1;
	if(myR < 17){
		if(mySum6[1] > 12) SpeInd[0] += 1;
	}else{
		if(mySum6[1] > 17) SpeInd[0] += 1;
	}
	if(myFQ[1][3] > 1 | Xminper > 0.4) SpeInd[0] += 1;
	// DEPI
	if(SumV > 0 | myFD > 2) SpeInd[1] += 1;
	if(ColShaBle[0] > 0 | myS > 2) SpeInd[1] += 1;
	if(EgoInd < 0.33){
		SpeInd[1] += 1;
	}else{
		if(EgoInd > 0.44 & myRefl == 0) SpeInd[1] += 1;
	}
	if(Afr < 0.46 | myBle.length < 4) SpeInd[1] += 1;
	if(((SumY + SumV + SumT) > (myFM + mym)) | SumCpr > 2) SpeInd[1] += 1;
	if(myMOR > 2 | Intell > 3) SpeInd[1] += 1;
	if(myCOP < 2 | IsoInd > 0.24) SpeInd[1] += 1;
	// CDI
	if(EA < 6 | AdjD < 0) SpeInd[2] +=1;
	if(myCOP < 2 & myAG < 2) SpeInd[2] +=1;
	if(WSumC < 2.5 | Afr < 0.46) SpeInd[2] +=1;
	if(a_p[1] > (a_p[0] + 1) | myCon[0] < 2) SpeInd[2] +=1;
	if(SumT > 1 | IsoInd > 0.24 | myFd > 0) SpeInd[2] +=1;
	// HVI
	var HVI = false;
	if(SumT == 0){
		count = 0;
		if(myZ[0] > 12) count += 1;
		if(myZ[1] - myZ[2] > 3.5) count += 1;
		if(myS > 3) count += 1;
		if(HumCon > 6) count += 1;
		if(myCon[1] + myCon[3] + myCon[6] + myCon[8] > 3) count += 1;
		if(((myCon[0] + myCon[5])/(myCon[2] + myCon[7])) < 4) count += 1;
		if(myCon[13] > 3) count += 1;
		if(count > 3) HVI = true;
	}
	if(HVI){
		RPD_8Text[4].innerHTML = "YES";
	}else{
		RPD_8Text[4].innerHTML = "NO";
	}
	// OBS
	var OBS = false;
	count = 0;
	if(myLoc_StrSum[3] > 3) count += 1;
	if(myZ[0] > 12) count += 1;
	if(myZ[1] - myZ[2] > 3) count += 1;
	if(myP > 7) count += 1;
	if(count > 1 &  myFQ[0][0] > 3) OBS = true;
	if(myFQ[0][0] > 1) count += 1;
	if(count == 5) OBS = true;
	if(count > 2 & Xpluper > 0.89) OBS = true;
	if(myFQ[0][0] > 3 & Xpluper > 0.89) OBS = true;
	if(OBS){
		RPD_8Text[5].innerHTML = "YES";
	}else{
		RPD_8Text[5].innerHTML = "NO";
	}

	RPD_8Text[0].innerHTML = SpeInd[0];
	var SpeIndCutoff = [4,3,7];
	for(let i=1; i<4; i++){
		if(SpeInd[i] > SpeIndCutoff[i]){
			RPD_8Text[i].innerHTML = SpeInd[i] + " (Pos)";
		}else{
			RPD_8Text[i].innerHTML = SpeInd[i] + " (Neg)";
		}
	}





	// Interpretation
	var IntOrdHtml = document.getElementById("IntOrd");
	var IntOrdText = "";
	if(SpeInd[0] > 3){
		IntOrdText = "Processing > Mediation > Ideation > Controls > Affect > Self-Perception > Interpersonal Perception";
		IntOrdHtml.innerHTML = "(PTI > 3) " + IntOrdText;
	} 
	if(IntOrdText == "" & SpeInd[1] > 5 & SpeInd[2] > 3){
		IntOrdText = "Interpersonal Perception > Self-Perception > Controls > Affect > Processing > Mediation > Ideation";
		IntOrdHtml.innerHTML = "(DEPI > 5 & CDI > 3) " + IntOrdText;
	}
	if(IntOrdText == "" & SpeInd[1] > 5){
		IntOrdText = "Affect > Controls > Self-Perception > Interpersonal Perception > Processing > Mediation > Ideation";
		IntOrdHtml.innerHTML = "(DEPI > 5) " + IntOrdText;
	}
	if(IntOrdText == "" & DScore < AdjD){
		IntOrdText = "Controls > Situation Stress > remaining";
		IntOrdHtml.innerHTML = "(D < adjD) " + IntOrdText;
	}
	if(IntOrdText == "" & SpeInd[2] > 3){
		IntOrdText = "Controls > Interpersonal Perception > Self-Perception > Affect >Processing > Mediation > Ideation";
		IntOrdHtml.innerHTML = "(CDI > 3) " + IntOrdText;
	}
	if(IntOrdText == "" & AdjD < 0){
		IntOrdText = "Controls > remaining";
		IntOrdHtml.innerHTML = "(adjD < 0) " + IntOrdText;
	}
	if(IntOrdText == "" & myL > 0.99){
		IntOrdText = "Processing > Mediation > Ideation > Controls > Affect > Self-Perception > Interpersonal Perception";
		IntOrdHtml.innerHTML = "(L > 0.99) " + IntOrdText;
	}
	if(IntOrdText == "" & myRefl > 0){
		IntOrdText = "Self-Perception > Interpersonal Perception > Controls > remaining";
		IntOrdHtml.innerHTML = "(Fr+rF > 0) " + IntOrdText;
	}
//	if(IntOrdText == "" & EB is introversive) IntOrdText = "Ideation > Processing > Mediation > Controls > Affect > Self-Perception > Interpersonal Perception";
//	if(IntOrdText == "" & EB is extratensive) IntOrdText =  "Affect > Self-Perception > Interpersonal Perception > Controls > Processing > Mediation > Ideation";
	if(IntOrdText == "" & a_p[1] > (a_p[0] + 1)){
		IntOrdText = "Ideation > Processing > Mediation > Controls > Self-Perception > Interpersonal Perception > Affect";
		IntOrdHtml.innerHTML = "(p > a+1) " + IntOrdText;
	}
	if(IntOrdText == "" & HVI){
		IntOrdText = "Ideation > Processing > Mediation > Controls > Self-Perception > Interpersonal Perception > Affect";
		IntOrdHtml.innerHTML = "(HVI positive) " + IntOrdText;
	}

	// Control and Stress Tolerance
	var ConStr_IntText = document.getElementsByName("ConStr_Int");
	var ConStr_Find = [null,null,null,null,null];
	// Step1
	if(AdjD == 0 & SpeInd[2] < 4) ConStr_Find[0] = 0;
	if(AdjD == 0 & SpeInd[2] >= 4) ConStr_Find[0] = 1;
	if(AdjD > 0) ConStr_Find[0] = 2;
	if(AdjD == -1) ConStr_Find[0] = 3;
	if(AdjD < -1) ConStr_Find[0] = 4;
	// Step2
	if((EA >= 7 & EA <= 11) & AdjD == 0) ConStr_Find[1] = 0;
	if((EA >= 7 & EA <= 11) & AdjD > 0) ConStr_Find[1] = 1;
	if(EA >= 7 & AdjD < 0) ConStr_Find[1] = 2;
	if(EA > 11 & AdjD > 0) ConStr_Find[1] = 3;
	if(EA > 11 & AdjD == 0) ConStr_Find[1] = 4;
	if(EA < 6.5 & AdjD < 0) ConStr_Find[1] = 5;
	if(EA < 6.5 & AdjD >= 0) ConStr_Find[1] = 6;
	// Step3
	if(EB[0] > 0 & EB[1] > 0 & EA > 3.5 & myL < 1) ConStr_Find[2] = 0;
	if(EB[0] > 0 & EB[1] > 0 & EA > 6 & myL > 0.99) ConStr_Find[2] = 1;
	if(EB[0] > 0 & EB[1] > 0 & EA < 4 & myL < 0.99) ConStr_Find[2] = 2;
	if(EB[0] > 0 & EB[1] > 0 & EA > 3.5 & EA < 6.5 & myL >= 1) ConStr_Find[2] = 3;
	if(EA < 4 & myL >= 1) ConStr_Find[2] = 4;
	if(myM == 0 & WSumC > 3.5) ConStr_Find[2] = 5;
	if(myM > 3 & WSumC == 0) ConStr_Find[2] = 6;
	// Step4
	if(Adjes >= 5 & Adjes <= 9) ConStr_Find[3] = 0;
	if(Adjes > 9) ConStr_Find[3] = 1;
	if(Adjes < 5) ConStr_Find[3] = 2;
	// Step5
	var ConStr_Find_Step5 = [];
	var ConStr_Table = document.getElementById("ConStr_Table");
	if(eb[0] < eb[1] & es >= 4) ConStr_Find_Step5.push(0);
	if(myFM > 5) ConStr_Find_Step5.push(1);
	if(myFM < 2) ConStr_Find_Step5.push(2);
	if(SumCpr > 2) ConStr_Find_Step5.push(3);
	if(SumV > 0) ConStr_Find_Step5.push(4);
	if(SumT > 1) ConStr_Find_Step5.push(5);
	if(ConStr_Find_Step5 != []){
		for(let i=0; i<ConStr_Find_Step5.length; i++){
			var ConStr5_addRow = ConStr_Table.insertRow(ConStr_Table.rows.length)
			for(let j=0; j<3; j++) ConStr5_addRow.insertCell(j).innerHTML = AllConStr_Int[1][4][ConStr_Find_Step5[i]][j]; 
		}
	}

	for(let j=0; j<4; j++) for(let i=0; i<3; i++) if(ConStr_Find[j] != null) ConStr_IntText[i+j*3].innerHTML = AllConStr_Int[1][j][ConStr_Find[j]][i];



	// Situationally Related Stress
	var SitStr_IntText = document.getElementsByName("SitStr_Int");
	var SitStr_Find = [null,null,null,null,null,null,null];
	var SitStr_Table = document.getElementById("SitStr_Table");
	// Step
	if(DScore < AdjD){
		// Step1
		if(es - Adjes >= 2) SitStr_Find[0] = 0;
		if(es - Adjes == 1) SitStr_Find[0] = 1;
		// Step2 ## need Add row
		if(AdjD - DScore == 1) SitStr_Find[1] = 0;
		if(AdjD - DScore > 1) SitStr_Find[1] = 1;
		// Step3
		if(mym <= 3*SumY & SumY <= 3*mym) SitStr_Find[2] = 0;
		if(mym > 3*SumY) SitStr_Find[2] = 1;
		if(SumY > 3*mym) SitStr_Find[2] = 2;
		// Step4
		if((SumT <= 1 & SumV == 0) | (SumV > 0 & EgoInd <= 0.32)) SitStr_Find[3] = 0;
		if((SumT > 1) | (SumV > 0 & EgoInd > 0.32)) SitStr_Find[3] = 1;
		// Step5 ## need Add row
		if(DScore >= 0) SitStr_Find[4] = 0;
		if(DScore < 0) SitStr_Find[4] = 1;
		// Step6
		if((m_YBle[0] + m_YBle[1] > 0) & m_YBle[2] < 0.2*myBle.length) SitStr_Find[5] = 0;
		if((m_YBle[2] >= 0.2*myBle.length) & (m_YBle[2] <= 0.3*myBle.length)) SitStr_Find[5] = 1;
		if(m_YBle[2] > 0.3*myBle.length) SitStr_Find[5] = 2;
		// Step7
		if(ColShaBle[1] == 0 & ColShaBle[2] == 1) SitStr_Find[6] = 0;
		if(ColShaBle[1] > 0 & ColShaBle[2] == 1) SitStr_Find[6] = 1;
		if(ColShaBle[1] == 0 & ColShaBle[2] > 1) SitStr_Find[6] = 2;
		if(ColShaBle[1] > 0 & ColShaBle[2] > 1) SitStr_Find[6] = 3;

		for(let j=0; j<7; j++) for(let i=0; i<3; i++) if(SitStr_Find[j] != null) SitStr_IntText[i+j*3].innerHTML = AllSitStr_Int[1][j][SitStr_Find[j]][i];

		if(SitStr_Find[0] == 1) {
			var SitStr_Table_S1_ind = document.getElementById("SitStr_Table_S1").rowIndex;
			var SitStr_Table_S1_addRow = SitStr_Table.insertRow(SitStr_Table_S1_ind);
			for(let i=0; i<3; i++) SitStr_Table_S1_addRow.insertCell(i).innerHTML = AllSitStr_Int[1][1][1][i];
		}

		if(SitStr_Find[4] == 1){
			var SitStr_Table_S5_ind = document.getElementById("SitStr_Table_S5").rowIndex;
			var SitStr_Table_S5_addRow = SitStr_Table.insertRow((SitStr_Table_S5_ind+2));
			if(DScore == -1) var AddFind = 2;
			if(DScore < -1) var AddFind = 3;
			for(let i=0; i<3; i++) SitStr_Table_S5_addRow.insertCell(i).innerHTML = AllSitStr_Int[1][4][AddFind][i];
		}
	}else{
		document.getElementById("SitStr_Section").style.display = "none";
	}



	// Affect
	var Aff_IntText = document.getElementsByName("Aff_Int");
	var Aff_Find = [null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null];
	var Aff_Table = document.getElementById("Aff_Table");
	var myCopSty = null;
	if((EB[0] >= EB[1] + 2 & EA <= 10) | (EB[0] > EB[1] + 2 & EA > 10)) myCopSty = "introversive style"
	if((EB[1] >= EB[0] + 2 & EA <= 10) | (EB[1] > EB[0] + 2 & EA > 10)) myCopSty = "extratensive style"
	if(myCopSty == null) myCopSty = "ambitent style"
	// Step1
	if((SpeInd[1] == 6 | SpeInd[1] == 7) & SpeInd[2] < 4) Aff_Find[0] = 0;
	if(SpeInd[1] == 5 & SpeInd[2] < 4) Aff_Find[0] = 1;
	if((SpeInd[1] == 6 | SpeInd[1] == 7) & (SpeInd[2] == 4 | SpeInd[2] == 5)) Aff_Find[0] = 2;
	if(SpeInd[1] == 5 & (SpeInd[2] == 4 | SpeInd[2] == 5)) Aff_Find[0] = 3;
	// Step2
	if(EA < 4) Aff_Find[1] = 0;
	if(EB[0] == 0 & EB[1] > 3.5) Aff_Find[1] = 1;
	if(EB[1] == 0 & EB[0] > 3) Aff_Find[1] = 2;
	if(myCopSty == "extratensive style" & myL < 1) Aff_Find[1] = 3;
	if(myCopSty == "extratensive style" & myL > 0.99) Aff_Find[1] = 4;
	if(myCopSty == "introversive style" & myL < 1) Aff_Find[1] = 5;
	if(myCopSty == "introversive style" & myL > 0.99) Aff_Find[1] = 6;
	if(myCopSty == "ambitent style" & myL < 1) Aff_Find[1] = 7;
	if(myCopSty == "ambitent style" & myL > 0.99) Aff_Find[1] = 8;
	// Step3
	if(myCopSty == "extratensive style" & myL < 1){
		if(EBPer < 2.5) Aff_Find[2] = 0;
		if(EBPer >= 2.5) Aff_Find[2] = 1;
	}
	if(myCopSty == "introversive style" & myL < 1){
		if(EBPer < 2.5) Aff_Find[2] = 2;
		if(EBPer >= 2.5) Aff_Find[2] = 3;
	}
	// Step4
	if(eb[0] > eb[1]){
		if(SumT <= 1 & SumCpr <= 2 & SumV == 0 & SumY <=2){
			Aff_Find[3] = 0;
		}else{
			Aff_Find[3] = 1;
		}
	}
	if((eb[1] > eb[0] & eb[0] >= 3) | (eb[1] >= 4 & eb[0] < 3)) Aff_Find[3] = 2;
	// Step5
	if(SumCpr > WSumC) Aff_Find[4] = 0;
	// Step6
	if(myL > 0.99){
		if(Afr >= 0.43 & Afr <= 0.65) Aff_Find[5] = 0;
		if(Afr > 0.65) Aff_Find[5] = 1;
		if(Afr > 0.43 & Afr < 0.45) Aff_Find[5] = 2;
		if(Afr < 0.44) Aff_Find[5] = 3;
	}else{
		if(myCopSty == "extratensive style"){
			if(Afr >= 0.6 & Afr <= 0.89) Aff_Find[5] = 0;
			if(Afr > 0.89) Aff_Find[5] = 1;
			if(Afr > 0.43 & Afr < 0.6) Aff_Find[5] = 2;
			if(Afr < 0.44) Aff_Find[5] = 3;
		}
		if(myCopSty == "introversive style"){
			if(Afr >= 0.53 & Afr <= 0.78) Aff_Find[5] = 0;
			if(Afr > 0.78) Aff_Find[5] = 1;
			if(Afr > 0.43 & Afr < 0.53) Aff_Find[5] = 2;
			if(Afr < 0.44) Aff_Find[5] = 3;
		}
		if(myCopSty == "ambitent style"){
			if(Afr >= 0.53 & Afr <= 0.83) Aff_Find[5] = 0;
			if(Afr > 0.83) Aff_Find[5] = 1;
			if(Afr > 0.43 & Afr < 0.53) Aff_Find[5] = 2;
			if(Afr < 0.44) Aff_Find[5] = 3;
		}
	}
	// Step7
	if(Intell >= 4 & Intell <= 6) Aff_Find[6] = 0;
	if(Intell > 6) Aff_Find[6] = 1;
	// Step8
	if(myCP > 0) Aff_Find[7] = 0;
	// Step9
	if(FC_ratio[0] >= FC_ratio[1] + 1 & FC_ratio[0] <= 2*FC_ratio[1] & PureC == 0) Aff_Find[8] = 0;
	if(FC_ratio[0] > 2*FC_ratio[1] & FC_ratio[0] < 3*FC_ratio[1] & PureC == 0) Aff_Find[8] = 1;
	if(FC_ratio[0] >= 3*FC_ratio[1] & PureC == 0) Aff_Find[8] = 2;
	if(FC_ratio[0] >= FC_ratio[1] + 1 & FC_ratio[0] <= 2*FC_ratio[1] & PureC == 1) Aff_Find[8] = 3;
	if(FC_ratio[0] > 2*FC_ratio[1] & PureC > 0) Aff_Find[8] = 4;
	if(FC_ratio[0] >= FC_ratio[1] + 1 & FC_ratio[0] <= 2*FC_ratio[1] & PureC > 0) Aff_Find[8] = 5;
	if(FC_ratio[1] >= FC_ratio[0] & FC_ratio[1] <= FC_ratio[0] + 2 & PureC <= 1) Aff_Find[8] = 6;
	if(FC_ratio[1] >= FC_ratio[0] & FC_ratio[1] <= FC_ratio[0] + 2 & PureC > 1) Aff_Find[8] = 7;
	if(FC_ratio[1] >= FC_ratio[0] + 3 & PureC == 0) Aff_Find[8] = 8;
	if(FC_ratio[1] >= FC_ratio[0] + 3 & PureC > 0) Aff_Find[8] = 9;
	// Step10
	if(PureC > 0) Aff_Find[9] = 0;
	// Step11
	if(myS < 3) Aff_Find[10] = 0;
	if(myS == 3 & !myS_Loc[0]) Aff_Find[10] = 1;
	if(myS > 3 & !myS_Loc[1]) Aff_Find[10] = 2;
	if(myS == 3 & myS_Loc[0]) Aff_Find[10] = 3;
	if(myS > 3 & myS_Loc[1]) Aff_Find[10] = 4;
	// Step12
	if(myL > 0.99){
		if(Ble_R_port >= 0.08 & Ble_R_port <= 0.14) Aff_Find[11] = 0;
		if(Ble_R_port < 0.08) Aff_Find[11] = 1;
		if(Ble_R_port > 0.14) Aff_Find[11] = 2
	}else{
		if(myCopSty == "introversive style"){
			if(Ble_R_port >= 0.13 & Ble_R_port <= 0.26) Aff_Find[11] = 0;
			if(Ble_R_port < 0.13) Aff_Find[11] = 1;
			if(Ble_R_port > 0.26) Aff_Find[11] = 2
		}
		if(myCopSty == "extratensive style"){
			if(Ble_R_port >= 0.19 & Ble_R_port <= 0.33) Aff_Find[11] = 0;
			if(Ble_R_port < 0.19) Aff_Find[11] = 1;
			if(Ble_R_port > 0.33) Aff_Find[11] = 2
		}
		if(myCopSty == "ambitent style"){
			if(Ble_R_port >= 0.16 & Ble_R_port <= 0.36) Aff_Find[11] = 0;
			if(Ble_R_port < 0.16) Aff_Find[11] = 1;
			if(Ble_R_port > 0.36) Aff_Find[11] = 2
		}
	}
	// Step13
	if(m_YBle[2] > 1) Aff_Find[12] = 0;
	// Step14
	var DetNumInBle = [0,0]
	if(myBleSplit){
		for(let i=0; i<myBleSplit.length; i++){
			if(myBleSplit[i].length == 3) DetNumInBle[0] += 1;
			if(myBleSplit[i].length > 3) DetNumInBle[1] += 1;
		}
	}
	if(DetNumInBle[0] > 0.25*myR | DetNumInBle[1] > 0) Aff_Find[13] = 0;
	// Step15
	if(myL > 0.99){
		if(myCopSty == "introversive style" & ColShaBle[1] > 0) Aff_Find[14] = 1;
	}else{
		if(myCopSty == "extratensive style" | myCopSty == "ambitent style"){
			if(ColShaBle[1] == 1) Aff_Find[14] = 0;
			if(ColShaBle[1] > 1) Aff_Find[14] = 1;
		}else{
			if(ColShaBle[1] > 0) Aff_Find[14] = 1;
		}
	}
	// Step16
	if(ShaBle > 0) Aff_Find[15] = 0;

	for(let j=0; j<16; j++) for(let i=0; i<3; i++) if(Aff_Find[j] != null) Aff_IntText[i+j*3].innerHTML = AllAff_Int[1][j][Aff_Find[j]][i];

	if(ColShaBle[2] > 0){
		if(Aff_Find[14] == 0 | Aff_Find[14] == 1){
			var Aff_Table_S15_ind = document.getElementById("Aff_Table_S15").rowIndex;
			var Aff_Table_S15_addRow = Aff_Table.insertRow(Aff_Table_S15_ind+2);
			for(let i=0; i<3; i++) Aff_Table_S15_addRow.insertCell(i).innerHTML = AllAff_Int[1][14][2][i];
		}else{
			for(let i=0; i<3; i++) Aff_IntText[i+14*3].innerHTML = AllAff_Int[1][14][2][i];
		}
	}



	// Information Processing
	var InfPro_IntText = document.getElementsByName("InfPro_Int");
	var InfPro_Find = [null,null,0,0,null,null,null,null,null];
	var InfPro_Table = document.getElementById("InfPro_Table");
	// Step1
	if(myL < 1 & myZ[0] <= 13 & myZ[0] >= 9) InfPro_Find[0] = 0;
	if(myL < 1 & myZ[0] > 13) InfPro_Find[0] = 1;
	if(myL < 1 & myZ[0] < 9) InfPro_Find[0] = 2;
	if(myL >= 1 & myZ[0] <= 10 & myZ[0] >= 6) InfPro_Find[0] = 3;
	if(myL >= 1 & myZ[0] > 10) InfPro_Find[0] = 4;
	if(myL >= 1 & myZ[0] < 6) InfPro_Find[0] = 5;
	// Step2
	if(W_D_Dd[1]/W_D_Dd[0] >= 1.3 & W_D_Dd[1]/W_D_Dd[0] <= 1.6 & W_D_Dd[2] < 4) InfPro_Find[1] = 0;
	if(W_D_Dd[1]/W_D_Dd[0] < 1.3) InfPro_Find[1] = 1;
	if(W_D_Dd[1]/W_D_Dd[0] > 1.6) InfPro_Find[1] = 2;
	// Step3
	var InfPro_S3_LocByCardText = document.getElementsByName("InfPro_S3_LocByCard");
	for(let i=0; i<10; i++) InfPro_S3_LocByCardText[i].innerHTML = myLoc_byCard[i];
	// Step4
	var W_M_ratio = W_D_Dd[0]/myM;
	if((myCopSty == "extratensive style" & W_M_ratio > 3) | (myCopSty == "introversive style" & W_M_ratio > 1.5) | (myCopSty == "ambitent style" & W_M_ratio > 2)) InfPro_Find[4] = 0;
	if((myCopSty == "extratensive style" & W_M_ratio <= 1.2) | (myCopSty == "introversive style" & W_M_ratio <= 0.75) | (myCopSty == "ambitent style" & W_M_ratio <= 1.2)) InfPro_Find[4] = 1;
	// Step5
	if(myZd <= 3 & myZd >= -3) InfPro_Find[5] = 0;
	if(myZd < -3) InfPro_Find[5] = 1;
	if(myZd > 3) InfPro_Find[5] = 2;
	// Step6
	if(myPSV > 0) InfPro_Find[6] = 0;
	// Step7
	var DQ_v_vp = myDQ[2] + myDQ[3];
	if(myCopSty == "extratensive style"){
		if(myDQ[0] >= 5 & myDQ[0] <= 8){
			if(DQ_v_vp <= 2){InfPro_Find[7] = 0;}else{InfPro_Find[7] = 1;}
		}
		if(myDQ[0] > 8){
			if(DQ_v_vp <= 2){InfPro_Find[7] = 2;}else{InfPro_Find[7] = 3;}
		}
		if(myDQ[0] < 5){
			if(DQ_v_vp <= 2){InfPro_Find[7] = 4;}else{InfPro_Find[7] = 5;}
		}
	}else if(myCopSty == "ambitent style"){
		if(myDQ[0] >= 5 & myDQ[0] <= 8){
			if(DQ_v_vp <= 1){InfPro_Find[7] = 0;}else{InfPro_Find[7] = 1;}
		}
		if(myDQ[0] > 8){
			if(DQ_v_vp <= 1){InfPro_Find[7] = 2;}else{InfPro_Find[7] = 3;}
		}
		if(myDQ[0] < 5){
			if(DQ_v_vp <= 1){InfPro_Find[7] = 4;}else{InfPro_Find[7] = 5;}
		}
	}else{
		if(myDQ[0] >= 7 & myDQ[0] <= 10){
			if(DQ_v_vp <= 1){InfPro_Find[7] = 0;}else{InfPro_Find[7] = 1;}
		}
		if(myDQ[0] > 8){
			if(DQ_v_vp <= 1){InfPro_Find[7] = 2;}else{InfPro_Find[7] = 3;}
		}
		if(myDQ[0] < 5){
			if(DQ_v_vp <= 1){InfPro_Find[7] = 4;}else{InfPro_Find[7] = 5;}
		}
	}
	// Step8
	InfPro_Find[8] = 0;
	var InfPro_S8_DQByCardText = document.getElementsByName("InfPro_S8_DQByCard");
	for(let i=0; i<10; i++) InfPro_S8_DQByCardText[i].innerHTML = myDQ_byCard[i];

	for(let j=0; j<9; j++) for(let i=0; i<3; i++) if(InfPro_Find[j] != null) InfPro_IntText[i+j*3].innerHTML = AllInfPro_Int[1][j][InfPro_Find[j]][i];

	if(W_D_Dd[2] > 3){
		if(InfPro_Find[1] == 0 | InfPro_Find[1] == 1 | InfPro_Find[1] == 2){
			var InfPro_Table_S2_ind = document.getElementById("InfPro_Table_S2").rowIndex;
			var InfPro_Table_S2_addRow = InfPro_Table.insertRow(InfPro_Table_S2_ind+2);
			for(let i=0; i<3; i++) InfPro_Table_S2_addRow.insertCell(i).innerHTML = AllInfPro_Int[1][1][3][i];
		}else{
			for(let i=0; i<3; i++) InfPro_IntText[i+3].innerHTML = AllInfPro_Int[1][1][3][i];
		}
	}
	if(myPSV > 1){
		var InfPro_Table_S6_ind = document.getElementById("InfPro_Table_S6").rowIndex;
		var InfPro_Table_S6_addRow = InfPro_Table.insertRow(InfPro_Table_S6_ind+1);
		for(let i=0; i<3; i++) InfPro_Table_S6_addRow.insertCell(i).innerHTML = AllInfPro_Int[1][6][1][i];
	}



	// Cognitive Mediation
	var CogMed_IntText = document.getElementsByName("CogMed_Int");
	var CogMed_Table = document.getElementById("CogMed_Table");
	var CogMed_Find = [null,null,null,null,null,null];
	var CogMed_Step3a = [false,false,false,false,false,false,false];
	// Step1
	if(XAper >= 0.78 & XAper <= 0.9 & WDAper >= XAper) CogMed_Find[0] = 0;
	if(XAper > 0.9 & WDAper >= XAper) CogMed_Find[0] = 1;
	if(XAper >= 0.78 & WDAper < 0.75) CogMed_Find[0] = 2;
	if(XAper >= 0.7 & XAper <= 0.77 & WDAper >= 0.8) CogMed_Find[0] = 3;
	if(XAper < 0.7 & WDAper >= 0.8) CogMed_Find[0] = 4;
	if(XAper >= 0.7 & XAper <= 0.77 & WDAper >= 0.75 & WDAper <= 0.79) CogMed_Find[0] = 5;
	if(XAper < 0.7 & WDAper < 0.75) CogMed_Find[0] = 6;
	// Step2
	if(myFQ[0][4] >= 2) CogMed_Find[1] = 0;
	// Step3
	if(Xminper < 0.15) CogMed_Find[2] = 0;
	if(Xminper >= 0.15 & Xminper <= 0.2) CogMed_Find[2] = 1;
	if(Xminper >= 0.21 & Xminper <= 0.25) CogMed_Find[2] = 2;
	if(Xminper > 0.25 & Xminper <= 0.7) CogMed_Find[2] = 3;
	if(Xminper > 0.7) CogMed_Find[2] = 4;
	// Step3a
	if(CogMed_Find[2] > 0){
		// Finding1
		CogMed_Step3a[0] = true;
		for(let i=3; i<10; i++) if(myMinus[0].includes(CardDict[i])) CogMed_Step3a[0] = false;
		// Finding2, 3, 4, 5
		var MinusCount = [0,0,0,0];
		for(let i=0; i<myMinus[0].length; i++){
			if(myMinus[0][i] == CardDict[7] | myMinus[0][i] == CardDict[8] | myMinus[0][i] == CardDict[9]) MinusCount[0] += 1;
			if(myMinus[1][i].includes("M") | myMinus[1][i].includes("m")) MinusCount[1] += 1;
			if(myMinus[1][i].includes("rF") | myMinus[1][i].includes("Fr") | myMinus[1][i].includes("FD")) MinusCount[2] += 1;
			if(myMinus[1][i] == "F") MinusCount[3] += 1;
		}
		for(let i=0; i<4; i++) if(MinusCount[i] > 0.5*myMinus[0].length) CogMed_Step3a[1+i] = true;
		// Finding 6, 7
		if(myMinus[0].length > 3){
			CogMed_Step3a[6] = true;
			CogMed_Step3a[5] = true;
		}
		// AddRow
		var CogMed_Table_S3a_ind = document.getElementById("CogMed_Table_S3a").rowIndex;
		for(let j=6; j>-1; j--) if(CogMed_Step3a[j]) {
			var CogMed_Table_S3a_addRow = CogMed_Table.insertRow(CogMed_Table_S3a_ind + 1);
			for(let i=0; i<3; i++) CogMed_Table_S3a_addRow.insertCell(i).innerHTML = AllCogMed_Int[1][6][j][i];
		} 
	}
	// Step3b
	if(myFQ[0][3] > 0){
		var CogMed_Table_S3b_ind = document.getElementById("CogMed_Table_S3b").rowIndex;
		var CogMed_Table_S3b_addRow = CogMed_Table.insertRow(CogMed_Table_S3b_ind + 1);
		for(let i=0; i<3; i++) CogMed_Table_S3b_addRow.insertCell(i).innerHTML = AllCogMed_Int[1][6][7][i];

		var Step3aText = document.getElementById("Step3aText");
		var myStep3aText = "所有 FQ-:<br>";
		for(let i=0; i<myMinus[0].length; i++) myStep3aText += (myMinus[0][i] + "; 決定因子: " + myMinus[1][i] + "; 內容: " + myMinus[2][i] + "<br>");
		document.getElementById("Step3aText").innerHTML = myStep3aText;
	}
	// Step4
	if(myR < 17){
		if(myP >= 4 & myP<= 6) CogMed_Find[3] = 0;
		if(myP > 6) CogMed_Find[3] = 1;
		if(myP < 4) CogMed_Find[3] = 2;
	}
	if(myR >= 17 & myR <= 28){
		if(myP >= 5 & myP<= 7) CogMed_Find[3] = 0;
		if(myP > 7) CogMed_Find[3] = 1;
		if(myP < 5) CogMed_Find[3] = 2;
	}
	if(myR > 28){
		if(myP >= 6 & myP<= 9) CogMed_Find[3] = 0;
		if(myP > 9) CogMed_Find[3] = 1;
		if(myP < 6) CogMed_Find[3] = 2;
	}
	// Step5
	if(myFQ[0][0] == 0) CogMed_Find[4] = 0;
	if(myFQ[0][0] >= 1 & myFQ[0][0] <= 3) CogMed_Find[4] = 1;
	if(myFQ[0][0] > 3) CogMed_Find[4] = 2;
	// Step6
	if(Xpluper >= 0.7 & Xpluper <= 0.85 & Xuper <= 0.2) CogMed_Find[5] = 0;
	if(Xpluper > 0.85) CogMed_Find[5] = 1;
	if(Xpluper >= 0.55 & Xpluper <= 0.69 & Xuper >= 0.2) CogMed_Find[5] = 2;
	if(Xpluper < 0.55) CogMed_Find[5] = 3;

	for(let j=0; j<6; j++) for(let i=0; i<3; i++) if(CogMed_Find[j] != null) CogMed_IntText[i+j*3].innerHTML = AllCogMed_Int[1][j][CogMed_Find[j]][i];



	// Ideation
	var Ide_IntText = document.getElementsByName("Ide_Int");
	var Ide_Table = document.getElementById("Ide_Table");
	var Ide_Find = [null,null,null,null,null,null,null,null,null,null,null];
	// Step1
	if(myCopSty == "introversive style" & myL < 1) Ide_Find[0] = 0;
	if(myCopSty == "introversive style" & myL > 0.99) Ide_Find[0] = 1;
	if(myCopSty == "extratensive style" & myL < 1) Ide_Find[0] = 2;
	if(myCopSty == "extratensive style" & myL > 0.99) Ide_Find[0] = 3;
	if(myCopSty == "ambitent style" & myL < 1) Ide_Find[0] = 4;
	if(myCopSty == "ambitent style" & myL > 0.99) Ide_Find[0] = 5;
	// Step2
	if(myCopSty == "introversive style" & EBPer < 2.5) Ide_Find[1] = 0;
	if(myCopSty == "introversive style" & EBPer >= 2.5) Ide_Find[1] = 1;
	if(myCopSty == "extratensive style" & EBPer < 2.5) Ide_Find[1] = 2;
	if(myCopSty == "extratensive style" & EBPer >= 2.5) Ide_Find[1] = 3;
	// Step3
	if(a_p[0] + a_p[1] == 4 & (a_p[0] == 0 | a_p[1] == 0)) Ide_Find[2] = 0;
	if(a_p[0] + a_p[1] > 4 & ((a_p[0] > 2*a_p[1] & a_p[0] <= 3*a_p[1]) | (a_p[1] > 2*a_p[0] & a_p[1] <= 3*a_p[0]))) Ide_Find[2] = 1;
	if(a_p[0] + a_p[1] > 4 & (a_p[0] > 3*a_p[1] | a_p[1] > 3*a_p[0])) Ide_Find[2] = 2;
	// Step4
	var Ide_Step4 = [OBS, HVI, myMOR >= 3];
	var Ide_Table_S4_ind = document.getElementById("Ide_Table_S4").rowIndex;
	for(let j=2; j>-1; j--) if(Ide_Step4[j]) {
		var Ide_Table_S4_addRow = Ide_Table.insertRow(Ide_Table_S4_ind + 1);
		for(let i=0; i<3; i++) Ide_Table_S4_addRow.insertCell(i).innerHTML = AllIde_Int[1][10][j][i];
	}
	// Step5
	if(eb[0] >= 3 & eb[0] <= 6 & mym > myFM) Ide_Find[3] = 0;
	if(eb[0] < 3) Ide_Find[3] = 1;
	if((eb[0] == 7 & mym <= 1) | (eb[0] > 7 & myFM > 5)) Ide_Find[3] = 2;
	if((eb[0] == 7 & myFM <= 4) | (eb[0] > 7 & myFM <= 5)) Ide_Find[3] = 3;
	// Step6
	if(myM > 1){
		if(Ma_Mp[1] ==  Ma_Mp[0] + 1) Ide_Find[4] = 0;
		if(Ma_Mp[1] >  Ma_Mp[0] + 1) Ide_Find[4] = 1;
	}
	// Step7
	if(Intell >= 4 & Intell <= 6) Ide_Find[5] = 0;
	if(Intell > 6) Ide_Find[5] = 1;
	// Step8
	if(mySum6[1] <= 6 & (mySS[1] + mySS[3] + mySS[5] + mySS[6] + mySS[7] + mySS[8] + mySS[9] == 0)) Ide_Find[6] = 0;
	if(mySum6[1] <= 6 & (mySS[1] + mySS[3] + mySS[5] + mySS[7] + mySS[9] == 0) & (mySS[6] + mySS[8] > 0)) Ide_Find[6] = 1;
	if(((myR >= 17 & mySum6[1] >= 7 & mySum6[1] <= 10) | (myR <= 16 & mySum6[1] >= 7 & mySum6[1] <= 9)) & (mySS[1] + mySS[3] + mySS[5] + mySS[7] + mySS[9] == 0)) Ide_Find[6] = 2;
	if((myR >= 17 & mySum6[1] >= 11 & mySum6[1] <= 17) | (myR <= 16 & mySum6[1] >= 10 & mySum6[1] <= 12)) Ide_Find[6] = 3;
	if((myR >= 17 & mySum6[1] >= 18) | (myR <= 16 & mySum6[1] > 12)) Ide_Find[6] = 4;
	// Step9
	if(Ide_Find[6] > 0){
		var Ide_Table_S9_ind = document.getElementById("Ide_Table_S9").rowIndex;
		for(let j=2; j>-1; j--){
			var Ide_Table_S9_addRow = Ide_Table.insertRow(Ide_Table_S9_ind + 1);
			for(let i=0; i<3; i++) Ide_Table_S9_addRow.insertCell(i).innerHTML = AllIde_Int[1][9][j][i];
		}
	}
	// Step10
	if(myFQ[1][3] == 0 & myFQ[1][4] == 0) Ide_Find[7] = 0;
	if(myFQ[1][3] == 1 & myFQ[1][4] == 0) Ide_Find[7] = 1;
	if(myFQ[1][3] == 0 & myFQ[1][4] == 1) Ide_Find[7] = 2;
	if(myFQ[1][3] + myFQ[1][4] > 1) Ide_Find[7] = 3;
	// Step11
	if(myM > 0) Ide_Find[8] = 0;

	for(let j=0; j<9; j++) for(let i=0; i<3; i++) if(Ide_Find[j] != null) Ide_IntText[i+j*3].innerHTML = AllIde_Int[1][j][Ide_Find[j]][i];



	// Self-Perception
	var SelPer_IntText = document.getElementsByName("SelPer_Int");
	var SelPer_Table = document.getElementById("SelPer_Table");
	var SelPer_Find = [null,null,null,null,null,null,null];
	// Step1
	var SelPer_Table_S1_ind = document.getElementById("SelPer_Table_S1").rowIndex;
	if(HVI){
		var SelPer_Table_S1_addRow = SelPer_Table.insertRow(SelPer_Table_S1_ind + 1);
		for(let i=0; i<3; i++) SelPer_Table_S1_addRow.insertCell(i).innerHTML = AllSelPer_Int[1][8][1][i];
	}
	if(OBS){
		var SelPer_Table_S1_addRow = SelPer_Table.insertRow(SelPer_Table_S1_ind + 1);
		for(let i=0; i<3; i++) SelPer_Table_S1_addRow.insertCell(i).innerHTML = AllSelPer_Int[1][8][0][i];
	}
	// Step2
	if(myRefl > 0) SelPer_Find[0] = 0;
	// Step3
	if(EgoInd > 0.45) SelPer_Find[1] = 0;
	if(EgoInd >= 0.33 & EgoInd <= 0.45) SelPer_Find[1] = 1;
	if(EgoInd >= 0.33 & EgoInd <= 0.45 & myRefl > 0) SelPer_Find[1] = 2;
	if(EgoInd < 0.33) SelPer_Find[1] = 3;
	// Step4
	if(myR >= 17 & myFD == 0 & SumV == 0) SelPer_Find[2] = 0;
	if((myFD == 1 | myFD == 2) & SumV == 0) SelPer_Find[2] = 1;
	if(myFD > 2 | SumV > 0) SelPer_Find[2] = 2;
	// Step5
	if(myCon[9] + myCon[22] == 2) SelPer_Find[3] = 0;
	if(myCon[9] + myCon[22] > 2) SelPer_Find[3] = 1;
	// Step6
	if(myMOR == 2) SelPer_Find[4] = 0;
	if(myMOR > 2) SelPer_Find[4] = 1;
	// Step7a
	if(myCopSty == "introversive style"){
		if(myH >= (myOthH + 2)) SelPer_Find[5] = 0;
		if(myH < (myOthH - 2)) SelPer_Find[5] = 3;
	}else{
		if(myR >= 17 & myR <= 27){
			if(myH > myOthH) SelPer_Find[5] = 1;
			if(myH < myOthH) SelPer_Find[5] = 4;
		}else{
			if(myH >= (myOthH + 1)) SelPer_Find[5] = 2;
			if(myH <= (myOthH - 1)) SelPer_Find[5] = 5;
		}
	}
	// Step7b
	if(HumCon > 0) {
		SelPer_Find[6] = 0;

		var SelPer_Table_S7b_ind = document.getElementById("SelPer_Table_S7b").rowIndex;
		var SelPer_Table_S7b_addRow = SelPer_Table.insertRow(SelPer_Table_S7b_ind + 1);
		var AllHumResp = [];
		for(let i=0; i<myRespForText.length; i++) if(myHum.includes(i)) AllHumResp.push(myRespForText[i]);
		SelPer_Table_S7b_addRow.insertCell(0).innerHTML = "";
		SelPer_Table_S7b_addRow.insertCell(1).innerHTML = "逐一回顧包含人類內容的所有反應";
		SelPer_Table_S7b_addRow.insertCell(2).innerHTML = AllHumResp.join("<br>");
	}

	for(let j=0; j<7; j++) for(let i=0; i<3; i++) if(SelPer_Find[j] != null) SelPer_IntText[i+j*3].innerHTML = AllSelPer_Int[1][j][SelPer_Find[j]][i];



	// Interpersonal Perception
	var IntPer_IntText = document.getElementsByName("IntPer_Int");
	var IntPer_Table = document.getElementById("IntPer_Table");
	var IntPer_Find = [null,null,null,null,null,null,null,null,null,null,null];
	// Step1
	if(SpeInd[2] == 4 | SpeInd[2] == 5) IntPer_Find[0] = 0;
	// Step2
	if(HVI) IntPer_Find[1] = 0;
	// Step3
	if(a_p[1] > (a_p[0] + 1)) IntPer_Find[2] = 0;
	// Step4
	if(myFd > 0) IntPer_Find[3] = 0;
	// Step5
	if(SumT == 1) IntPer_Find[4] = 0;
	if(SumT == 0) IntPer_Find[4] = 1;
	if(SumT > 0) IntPer_Find[4] = 2;
	// Step6
	function Step6Finding(pureH, AllHs, CopSty, Lambda, Rnumb){
		var IntPer_Step6_Range = [[[4,6],[2,4],[2,4],[2,5]],[[5,8],[4,7],[3,6],[4,7]],[[7,11],[5,9],[4,7],[5,9]]];
		if(Rnumb <= 16) var RRang = 0;
		if(Rnumb >= 17 & Rnumb <= 27) var RRang = 1;
		if(Rnumb > 27) var RRang = 2;
		if(Lambda > 0.99){
			var Sty = 3;
		}else{
			var Sty = ["introversive style", "ambitent style", "extratensive style"].indexOf(CopSty);
		}
		if(AllHs >= IntPer_Step6_Range[RRang][Sty][0] & AllHs <= IntPer_Step6_Range[RRang][Sty][1]){
			if(Sty == 0){
				if(pureH > AllHs/2) {return(0)} else {return(1)};
			}else{
				if(pureH >= AllHs/2) {return(0)} else {return(1)};
			}
		}
		if(AllHs > IntPer_Step6_Range[RRang][Sty][1]){
			if(Sty == 0){
				if(pureH > AllHs/2) {return(2)} else {return(3)};
			}else{
				if(pureH >= AllHs/2) {return(2)} else {return(3)};
			}
		}
		if(AllHs < IntPer_Step6_Range[RRang][Sty][0]){
			if(Rnumb < 17){
				return(4);
			}else{
				if(Sty == 0){
					if(pureH > AllHs/2) {return(5)} else {return(6)};
				}else{
					if(pureH >= AllHs/2) {return(5)} else {return(6)};
				}
			}
		}
	}
	IntPer_Find[5] = Step6Finding(myH, HumCon, myCopSty, myL, myR);
	// Step7
	if(myGHR + myPHR >= 3){
		if(myGHR > myPHR){IntPer_Find[6] = 0;}else{IntPer_Find[6] = 1;}
	}
	// Step8
	if(myCOP == 0 & (myAG == 0 | myAG == 1)) IntPer_Find[7] = 0;
	if(((myCOP == 0 | myCOP == 1) & (myAG >= 2)) | (myCOP == 2 & myAG > 2)) IntPer_Find[7] = 1;
	if((myCOP == 1 | myCOP == 2) & (myAG == 0 | myAG == 1)) IntPer_Find[7] = 2;
	if((myCOP == 2 | myCOP == 3) & myAG == 2) IntPer_Find[7] = 3;
	if((myCOP >= 3 & (myAG == 0 | myAG == 1)) | (myCOP > 3 & myAG <= 2)) IntPer_Find[7] = 4;
	if(myCOP >= 3 & myAG > 2) IntPer_Find[7] = 5;
	// Step9
	if(myPER == 2 | myPER == 3) IntPer_Find[8] = 0;
	if(myPER > 3) IntPer_Find[8] = 1;
	// Step10
	if(IsoInd >= 0.26 & IsoInd <= 0.32) IntPer_Find[9] = 0;
	if(IsoInd > 0.32) IntPer_Find[9] = 1;
	// Step11
	var IntPer_Table_S11_ind = document.getElementById("IntPer_Table_S11").rowIndex;
	var IntPer_Table_S11_addRow = IntPer_Table.insertRow(IntPer_Table_S11_ind + 1);
	var AllPairMFMResp = [];
	for(let i=0; i<myRespForText.length; i++) if(myIntPer_S11.includes(i)) AllPairMFMResp.push(myRespForText[i]);
	IntPer_Table_S11_addRow.insertCell(0).innerHTML = "";
	IntPer_Table_S11_addRow.insertCell(1).innerHTML = "回顧所有包含 (2) 的 M & FM，<br>也確認其中不尋常的語言表達，<br>以確認是否與前面的發現一致";
	IntPer_Table_S11_addRow.insertCell(2).innerHTML = AllPairMFMResp.join("<br>");


	for(let j=0; j<10; j++) for(let i=0; i<3; i++) if(IntPer_Find[j] != null) IntPer_IntText[i+j*3].innerHTML = AllIntPer_Int[1][j][IntPer_Find[j]][i];


//	document.getElementById("testText2").innerHTML = myIntPer_S11;
}






// Step4 的所有發現可以共同出現


/*
function openDetDia(){
	var Dial = document.getElementById("DetDialog");
	Dial.showModal();
}

function confDetWin(){
	var Dial = document.getElementById("DetDialog");
	var AllDetRad = document.querySelectorAll('[data-label="AllDet"]');
	var outP = [];

	for(let i=0; i<AllDetRad.length; i++){
		if(AllDetRad[i].checked) outP.push(AllDetDict[i])
		AllDetRad[i].checked = false;
	} 
	document.getElementById("RespDet").value = outP.join('.');
	Dial.close();
}

function resDetWin(){
	var Dial = document.getElementById("DetDialog");
	var AllDetRad = document.querySelectorAll('[data-label="AllDet"]');

	for(let i=0; i<AllDetRad.length; i++) AllDetRad[i].checked = false;
}





function openSSDia(){
	var Dial = document.getElementById("SSDialog");
	Dial.showModal();
}

function confSSWin(){
	var Dial = document.getElementById("SSDialog");
	var AllSSChe = document.querySelectorAll('[data-label="AllSS"]');
	var outP = [];

	for(let i=0; i<AllSSChe.length; i++){
		if(AllSSChe[i].checked) outP.push(AllSSDict[i]);
		AllSSChe[i].checked = false;
	} 
	document.getElementById("RespSS").value = outP.join(',');
	Dial.close();
}

function resSSWin(){
	var Dial = document.getElementById("SSDialog");
	var AllSSChe = document.querySelectorAll('[data-label="AllSS"]');

	for(let i=0; i<AllSSChe.length; i++) AllSSChe[i].checked = false;
}




function openConDia(){
	var Dial = document.getElementById("ConDialog");
	Dial.showModal();
}

function confConWin(){
	var Dial = document.getElementById("ConDialog");
	var AllConChe_Rad = document.querySelectorAll('[data-label="AllCon"]');
	var outP = [];

	for(let i=0; i<AllConChe_Rad.length; i++){
		if(AllConChe_Rad[i].checked) outP.push(AllConDict[i]);
		AllConChe_Rad[i].checked = false;
	} 
	document.getElementById("RespCon").value = outP.join(',');
	Dial.close();
}

function resConWin(){
	var Dial = document.getElementById("ConDialog");
	var AllConChe_Rad = document.querySelectorAll('[data-label="AllCon"]');

	for(let i=0; i<AllConChe_Rad.length; i++) AllConChe_Rad[i].checked = false;
}

*/


function test1(){
	var AResp = document.getElementsByName("Resp");

	AllResp = [["Card I","1","W","o","1","F","o"," ","A","P","ZW"," "],
	["Card I","2","D","+","4","Ma","o","(2)","H,Id"," ","ZA"," "],
	["Card I","3","WS","o","1","Ma","u"," ","(Hd)"," ","ZS"," "],
	["Card II","4","WS","o","1","Mp.CF","-"," ","Hd"," ","ZS","MOR,AB"],
	["Card III","5","D","+","1","Ma","o","(2)","H,Hh","P","ZA","COP"],
	["Card III","6","WS","o","1","F","-"," ","Hd"," ","ZW"," "],
	["Card IV","7","W","o","1","FD","o"," ","(A)"," ","ZW"," "],
	["Card V","8","W","o","1","F","o"," ","A","P","ZW"," "],
	["Card V","9","D","o","7","F","u"," ","(A)"," "," "," "],
	["Card VI","10","W","o","1","F","o"," ","(A)"," ","ZW","MOR,DV1"],
	["Card VII","11","D","+","9","Ma.FY","o","(2)","Hd","P","ZD","AG"],
	["Card VIII","12","W","+","1","FMa.Fr.FC","o"," ","A,Na","P","ZW","INC1"],
	["Card VIII","13","D","v/+","4","FC.FV","o"," ","Ls"," ","ZA"," "],
	["Card VIII","14","DdS","o","99","FC","-"," ","Ad"," ","ZS","PER"],
	["Card IX","15","W","v","1","Ma.C"," "," ","Hx"," "," ","AB "],
	["Card X","16","W","+","1","Mp","u"," ","(H),Art"," ","ZW"," "],
	["Card X","17","DdS","+","22","F","-"," ","Hd,Id"," ","ZA"," "]];
	for(let j=0; j<AllResp.length; j++) {
		for(let i=0; i<12; i++) AResp[i].value = AllResp[j][i];
		addResp();
	}
}

function test3(){
	var AResp = document.getElementsByName("Resp");

	AllResp = [["Card I","1","WS","o","1","Ma","o"," ","Ad"," ","ZS","INC1"],
	["Card I","2","W","o","1","Ma","o","(2)","(H)"," ","ZW"," "],
	["Card II","3","W","+","1","FC.Ma","u","(2)","A"," ","ZW","COP,MOR,FAB1"],
	["Card II","4","D","+","3","FC'.ma","o"," ","Fi,Bt"," ","ZA"," "],
	["Card III","5","D","+","1","Ma","-","(2)","H,An,Cg","P","ZA","MOR,PER,COP,AG"],
	["Card IV","6","W","+","1","FV.Map.YF","-"," ","H,Na","P","ZA","AG"],
	["Card V","7","W","o","1","F","o"," ","A,Art","P","ZW","PER,DR1"],
	["Card V","8","W","o","1","FMp","o"," ","A"," ","ZW"," "],
	["Card VI","9","W","+","1","Mp.FY","-"," ","H,Ls"," ","ZW"," "],
	["Card VI","10","W","v/+","1","ma","u"," ","Na"," ","ZW"," "],
	["Card VII","11","D","+","2","Mp.ma","o","(2)","H","P","ZD","COP"],
	["Card VII","12","Dd","+","99","Ma.FY","-","(2)","H,Hx"," ","ZA","AG"],
	["Card VIII","13","D","+","1","FMa.FC","u","(2)","A,Bt","P","ZA"," "],
	["Card VIII","14","W","v","1","FC.ma","o"," ","Bt"," "," "," "],
	["Card IX","15","D","+","9","FC.ma","-"," ","An,Bl,Sx"," ","ZA"," "],
	["Card X","16","Dd","+","99","Mp.CF","-","(2)","A,Id"," ","ZA","INC1"]];
	for(let j=0; j<AllResp.length; j++) {
		for(let i=0; i<12; i++) AResp[i].value = AllResp[j][i];
		addResp();
	}
}

function test2(){
	var AResp = document.getElementsByName("Resp");

	AllResp = [["Card I","1","WS","o","1","FC'","o"," ","Art,(A)"," ","ZS","AB"],
	["Card I","2","W","+","1","F","u","(2)","Art,(H)"," ","ZA"," "],
	["Card II","3","W","+","1","FMa.FC'.CF","o","(2)","A,Bl"," ","ZW","AG,MOR"],
	["Card II","4","DS","+","5","ma.VF","u"," ","Sc,Cl"," ","ZW"," "],
	["Card III","5","D","+","1","Ma","o","(2)","H,Id","P","ZA","AG"],
	["Card III","6","D","o","3","F","u"," ","Sc"," "," "," "],
	["Card IV","7","W","+","1","Ma.FD.TF","o"," ","H,Cg,Na","P","ZA","MOR"],
	["Card V","8","W","o","1","FMa.FC'","u"," ","A"," ","ZW","AG"],
	["Card VI","9","W","o","1","FT","o"," ","Ad","P","ZW","MOR"],
	["Card VI","10","D","+","4","ma","o"," ","Sc,Na"," ","ZW"," "],
	["Card VI","11","D","v","1","C'"," "," ","An"," "," ","MOR"],
	["Card VII","12","W","+","1","Ma","o","(2)","H,Ls","P","ZW","AG"],
	["Card VIII","13","W","o","1","FC.FC'","o"," ","Art"," ","ZW","AB"],
	["Card VIII","14","DS","o","3","F","o"," ","An"," ","ZS","PER"],
	["Card IX","15","W","+","1","FD.FC.FV","u"," ","Art"," ","ZW"," "],
	["Card X","16","D","v","1","CF.mp","o"," ","Na,Art"," "," "," "],
	["Card X","17","D","+","10","FC","o","(2)","A"," ","ZA","FAB1"],
	["Card X","18","DS","o","11","FC'","-"," ","Xy"," ","ZS"," "],
	["Card X","19","D","+","6","Ma","o","(2)","H,Cg"," ","ZA","COP"]];
	for(let j=0; j<AllResp.length; j++) {
		for(let i=0; i<12; i++) AResp[i].value = AllResp[j][i];
		addResp();
	}
}


function test4(){
	var AResp = document.getElementsByName("Resp");

	AllResp = 
	[["Card I","1","W","o","1","FC'","o"," ","A","P","ZW"," "],
	["Card I","2","D","o","3","F","o"," ","Hd"," "," "," "],
	["Card II","3","DS","+","6","FV.CF.mp","u"," ","Sc,Na"," ","ZS"," "],
	["Card II","4","DS","+","5","FD","o"," ","Na,Ay"," ","ZS"," "],
	["Card III","5","D","+","1","Ma.FC'","o","(2)","H,Sc","P","ZA","COP"],
	["Card III","6","D","o","3","FC","o"," ","A"," "," "," "],
	["Card IV","7","D","+","6","F","o","(2)","Cg"," ","ZD","MOR"],
	["Card IV","8","W","+","1","FMp.FV","o"," ","Ad,Bt"," ","ZA"," "],
	["Card V","9","W","+","1","Map.FV.mp.FT","+","(2)","H,Cg"," ","ZA","PER,COP"],
	["Card V","10","W","o","1","FMp","o"," ","A"," ","ZW"," "],
	["Card VI","11","W","o","1","FY.FT","o"," ","A","P","ZW","MOR"],
	["Card VI","12","D","+","4","ma","o"," ","Sc,Ex,Na"," ","ZA","AG"],
	["Card VII","13","W","+","1","Ma.mp","o","(2)","H,Sc","P","ZW","COP"],
	["Card VIII","14","W","+","1","FC'.FC","o"," ","Bt,Hh"," ","ZW"," "],
	["Card VIII","15","DdS","o","32","F","o"," ","A"," "," "," "],
	["Card VIII","16","D","o","1","F","o","(2)","A","P"," "," "],
	["Card IX","17","W","+","1","CF","o"," ","Bt,Hh"," ","ZW"," "],
	["Card IX","18","D","+","1","Ma","o"," ","H,Sc"," ","ZA"," "],
	["Card IX","19","DS","o","8","F","u"," ","Hh"," "," "," "],
	["Card X","20","D","v","1","CF.mp","o","(2)","Na"," "," "," "],
	["Card X","21","D","+","11","Ma","u","(2)","(H),Id"," ","ZA","COP"],
	["Card X","22","D","o","13","FC.FMp","o"," ","A"," "," "," "],
	["Card X","23","D","+","6","Ma","u","(2)","H,Id"," ","ZA","COP"],
	["Card X","24","D","+","10","Mp","o"," ","H,Sc"," ","ZA"," "]];
	for(let j=0; j<AllResp.length; j++) {
		for(let i=0; i<12; i++) AResp[i].value = AllResp[j][i];
		addResp();
	}
}




//
function openPdf(){
	var checkLoc = document.getElementsByName("StrSum_Loc");
	var countLoc = 0;
	for(let i=0; i<5; i++) countLoc += Number(document.getElementsByName("StrSum_Loc")[i].innerHTML);
	if(countLoc == 0){
		alert("請先輸入資料並按下 GOGO 後，再輸出");
	}else{
		window.open("RorPdf.html");
	}
}


// 列印
function printOut(){
	var checkLoc = document.getElementsByName("StrSum_Loc");
	var countLoc = 0;
	for(let i=0; i<5; i++) countLoc += Number(document.getElementsByName("StrSum_Loc")[i].innerHTML);
	if(countLoc == 0){
		alert("請先輸入資料並按下 GOGO 後，再輸出");
	}else{
		if(document.getElementsByName("Zscore")[0].innerHTML){
			window.print();
			return null;
		}
		var count = 0;

		var RespFromParent = document.getElementById("ParentResp").innerHTML;
		RespFromParent = RespFromParent.split("--").reverse();

		var SeqScoTable = document.getElementById("SeqScoTable");
		var SeqSco_ind = document.getElementById("SeqSco").rowIndex;
		var CardColor = ["Card I", "Card III", "Card V", "Card VII", "Card IX"];
		var AllCard = [];
		for(let i=0; i<RespFromParent.length; i++) {
			var SeqSco_addRow = SeqScoTable.insertRow((SeqSco_ind + 1));
			for(let j=0; j<10; j++) SeqSco_addRow.insertCell(j).innerHTML = RespFromParent[i].split(";")[j];
			if(CardColor.includes(RespFromParent[i].split(";")[0])){
				SeqSco_addRow.style = "background-color:#F0F0F0;";
			}else{
				SeqSco_addRow.style = "background-color:#D0D0D0;";
			}
			AllCard.push(RespFromParent[i].split(";")[0]);
		}
		AllCard = AllCard.reverse();
		for(let i=9; i<8+RespFromParent.length; i++) if(SeqScoTable.rows[i].cells[0].innerHTML == AllCard[i-9]) SeqScoTable.rows[i].cells[0].innerHTML = "";


		var Zscore_Ele = document.getElementsByName("StrSum_Z");
		var Zscore_Pdf = document.getElementsByName("Zscore");
		for(let i=0; i<3; i++) Zscore_Pdf[i].innerHTML = Zscore_Ele[i].innerHTML;


		var DQCol_Ele = document.getElementsByName("StrSum_DQ");
		var DQCol_Pdf = document.getElementsByName("DQCol");
		for(let i=0; i<4; i++) DQCol_Pdf[i].innerHTML = DQCol_Ele[i].innerHTML;


		var LocCol_Ele = document.getElementsByName("StrSum_Loc");
		var LocCol_Pdf = document.getElementsByName("LocCol");

		var FQCol_Ele = document.getElementsByName("StrSum_FQ");
		var FQCol_Pdf = document.getElementsByName("FQCol");

		for(let i=0; i<5; i++){
			LocCol_Pdf[i].innerHTML = LocCol_Ele[i].innerHTML;
			for(let j=0; j<3; j++) FQCol_Pdf[j+i*3].innerHTML = FQCol_Ele[i+j*5].innerHTML;
		}


		var DetCol_Ele = document.getElementsByName("StrSum_Det");
		var DetCol_Pdf = document.getElementsByName("DetCol");
		for(let i=0; i<24; i++) DetCol_Pdf[i].innerHTML = DetCol_Ele[i].innerHTML;


		var ConCol_Ele = document.getElementsByName("StrSum_Con");
		var ConCol_Pdf = document.getElementsByName("ConCol");
		for(let i=0; i<27; i++) ConCol_Pdf[i].innerHTML = ConCol_Ele[i].innerHTML;


		var SSCol_Ele = document.getElementsByName("StrSum_SS");
		var SSCol_Pdf = document.getElementsByName("SSCol");
		for(let i=0; i<19; i++) SSCol_Pdf[i].innerHTML = SSCol_Ele[i].innerHTML;

		var Sum6Col_Ele = document.getElementsByName("StrSum_Sum6");
		var Sum6Col_Pdf = document.getElementsByName("Sum6Col");
		for(let i=0; i<2; i++) Sum6Col_Pdf[i].innerHTML = Sum6Col_Ele[i].innerHTML;


		var AppCol_Ele = document.getElementsByName("InfPro_S3_LocByCard");
		var AppCol_Pdf = document.getElementsByName("AppCol");
		for(let i=0; i<10; i++) AppCol_Pdf[i].innerHTML = AppCol_Ele[i].innerHTML;


		var BlendsCol_Ele = document.getElementById("ParentBlends").innerHTML.split(",");
		var BlendsCol_Pdf = document.getElementsByName("BlendsCol");
		for(let i=0; i<BlendsCol_Ele.length; i++) BlendsCol_Pdf[i].innerHTML = BlendsCol_Ele[i];


		var CoreCol_Ele = document.getElementsByName("RPD_1");
		var CoreCol_Pdf = document.getElementsByName("CoreCol");
		for(let i=0; i<CoreCol_Ele.length; i++) CoreCol_Pdf[i].innerHTML = CoreCol_Ele[i].innerHTML;


		var AffCol_Ele = document.getElementsByName("RPD_3");
		var AffCol_Pdf = document.getElementsByName("AffCol");
		for(let i=0; i<AffCol_Ele.length; i++) AffCol_Pdf[i].innerHTML = AffCol_Ele[i].innerHTML;


		var IntPerCol_Ele = document.getElementsByName("RPD_6");
		var IntPerCol_Pdf = document.getElementsByName("IntPerCol");
		for(let i=0; i<IntPerCol_Ele.length; i++) IntPerCol_Pdf[i].innerHTML = IntPerCol_Ele[i].innerHTML;


		var IdeCol_Ele = document.getElementsByName("RPD_2");
		var IdeCol1_Pdf = document.getElementsByName("IdeCol");
		var IdeCol2_Pdf = document.getElementsByName("IdeCol2");
		for(let i=0; i<IdeCol1_Pdf.length; i++) IdeCol1_Pdf[i].innerHTML = IdeCol_Ele[i].innerHTML;
		for(let i=0; i<IdeCol2_Pdf.length; i++) IdeCol2_Pdf[i].innerHTML = IdeCol_Ele[i+IdeCol1_Pdf.length].innerHTML;


		var MedCol_Ele = document.getElementsByName("RPD_4");
		var MedCol_Pdf = document.getElementsByName("MedCol");
		for(let i=0; i<MedCol_Ele.length; i++) MedCol_Pdf[i].innerHTML = MedCol_Ele[i].innerHTML;


		var InfProCol_Ele = document.getElementsByName("RPD_5");
		var InfProCol_Pdf = document.getElementsByName("InfProCol");
		for(let i=0; i<InfProCol_Ele.length; i++) InfProCol_Pdf[i].innerHTML = InfProCol_Ele[i].innerHTML;


		var SelPerCol_Ele = document.getElementsByName("RPD_7");
		var SelPerCol_Pdf = document.getElementsByName("SelPerCol");
		for(let i=0; i<SelPerCol_Ele.length; i++) SelPerCol_Pdf[i].innerHTML = SelPerCol_Ele[i].innerHTML;


		var SelPerCol_Ele = document.getElementsByName("RPD_7");
		var SelPerCol_Pdf = document.getElementsByName("SelPerCol");
		for(let i=0; i<SelPerCol_Ele.length; i++) SelPerCol_Pdf[i].innerHTML = SelPerCol_Ele[i].innerHTML;


		var SpeIndCol_Ele = document.getElementsByName("RPD_8");
		var SpeIndCol_Pdf = document.getElementsByName("SpeIndCol");
		for(let i=0; i<SpeIndCol_Ele.length; i++) SpeIndCol_Pdf[i].innerHTML = SpeIndCol_Ele[i].innerHTML;

		window.print();
	}
}
